[
{"url": "https://abcnews.go.com/Sports/mckenzie-milton-released-hospital-watch-american-title-game/story?id=59544456", "body": "\n UCF quarterback McKenzie Milton has been released from the hospital and plans to watch his team's American championship game against Memphis from home.\nMilton's mother, Teresa, told ESPN's Maria Taylor that the quarterback was able to go home Friday, one week after a devastating knee injury that led to blood flow issues and nerve damage in his right leg.\nMilton already has undergone three surgeries and is recovering well from the vascular part of his injury, his mother said. If his recovery continues to go well, he could have reconstructive knee surgery in four to six weeks.\nHe was injured when he took a helmet to his knee on a scramble against USF. Milton was carted off the field and rushed to Tampa General Hospital, where he had emergency surgery.\n\n\nUCF players have vowed to play the remainder of the season in Milton's honor. The team plans to distribute 40,000 leis to fans to celebrate Milton, who was born in . UCF will also have 808, the Hawaii area code, and 10Hana on players' helmets.\n\n\"We're playing for 10,\" center Jordan Johnson said earlier this week, referencing Milton's jersey number. \"We're going to go out there and put it all out there for McKenzie, because we know that's what he'd want.\"\nMilton recorded a short video thanking fans for their outpouring of support. He also taped a video that will be played for the team before the game, and UCF set up his locker as if he were playing.\n\nMilton has been involved in the preparation for Saturday's game, FaceTiming into quarterback meetings all week as the Knights turn to freshman backup Darriel Mack for the remainder of the season.", "title": "McKenzie Milton released from hospital, to watch American title game at home", "author": "ANDREA ADELSON", "date": "Dec 1, 2018, 12:46 PM ET"},
{"url": "https://abcnews.go.com/Sports/wireStory/cfp-hopeful-oklahoma-beats-texas-big-12-59547578", "body": "\n\nKyler Murray threw for 379 yards and three touchdowns as No. 5 Oklahoma beat No. 9 Texas 39-27 in the Big 12 championship game Saturday, with the Sooners avenging their only loss and making their case for a return to the College Football Playoff.\nMurray, the Heisman Trophy-contending dual-threat quarterback who was 25-of-34 passing, threw two of his TDs to Grant Calcaterra. That included an impressive one-handed grab for an 18-yard score on a third-and-10 play with two minutes left as the Sooners (12-1, No. 5 CFP) won their seventh consecutive game.\n\"That catch will live on in Oklahoma history forever,\" coach Lincoln Riley said. \"What a play.\"\nOklahoma is the first Power Five team to win four consecutive outright conference titles since Florida in the SEC in the mid-1990s.\n\"We're thrilled by the victory. It's been a challenging year, which they all are,\" Riley said. \"But to sit here now as four-time defending Big 12 champion, man, that sounds good.\"\nSam Ehlinger was 23-of-36 passing for 349 yards with two touchdowns, and he also ran for two scores for Texas (9-4), but his final pass was picked off by Tre Norwood at the 1 in the final minute.\nThe Sooners went ahead to stay on Austin Seibert's third field goal, a 31-yarder with 12:37 left that was good after ricocheting off the top of the left upright to make it 30-27.\nTwo plays after Oklahoma's only turnover, when receiver CeeDee Lamb fumbled inside the 10 after a 54-yard catch-and-run with nine minutes left, the Sooners got points anyway. Cornerback Tre Brown blitzed and sacked Ehlinger in the end zone for a safety.\n\"Our defense did a great job getting the ball back to us, offensively we didn't take care of our part of the bargain,\" Ehlinger said. \"That's on us, that's on me. I will make it my mission to never let this team or this school feel this disappointment again.\"\nIt was a huge play for a much-maligned Sooners defense that had allowed at least 40 points in each of the previous four games — three of those OU wins by a combined nine points.\nLamb finished with six catches for 167 yards, including a 28-yard touchdown in the first half.\nThe 114th meeting between the Red River rivals was their first in a championship game — and the first time since 1903 they had played twice in the same season. Every game since 1929 had been played about 20 miles away at the State Fair of Texas, where the Longhorns beat Oklahoma 48-45 eight weeks ago.\nOklahoma never trailed after Murray threw TDs on its last two drives before halftime for a 20-14 lead, on Calcaterra's 6-yard TD pass in the final minute when the Sooners were out of timeouts but went 80 yards in five plays.\nThe Sooners were up 27-21 until Ehlinger threw a 5-yard TD to Lil'Jordan Humphrey with 2:44 left in the third quarter. But the extra point that would have put Texas ahead was partially blocked and clanged off the crossbar no good.\nTHE TAKEAWAY\nTexas: The Longhorns have come a long way in two seasons under coach Tom Herman. They were coming off three consecutive losing seasons for the first time since the 1930s when he became coach. Herman said it is difficult after a loss, and with still a game to play, to reflect on the season and just how much progress has been made.\n\"We earned the right to play in a big-time bowl game,\" Herman said.\nOklahoma: The Sooners won their 12th overall Big 12 title. They are the only Big 12 team that has made it into the College Football Playoff, going in 2015 and again last season with Heisman Trophy-winning quarterback Baker Mayfield. They haven't made it to a CFP title game.\nRECEIVING RECORD\nTexas WR Collin Johnson set a Big 12 championship game record with his 177 yards receiving on eight catches. He had a 27-yard TD catch in the third quarter on a drive when he also had catches of 25 and 21 runs.\nUP NEXT\nTexas will go to its first Sugar Bowl since 1995 if Oklahoma gets into the College Football Playoff. If not, the Longhorns are likely headed to the Alamo Bowl.\nOklahoma waits to find out if it gets into the College Football Playoff, which could mean playing in the same stadium in four weeks for the Cotton Bowl. If not, the Sooners go to the Sugar Bowl to play an SEC team.\n———\nMore AP college football: https://apnews.com/tag/Collegefootball and https://twitter.com/AP—Top25 ", "title": "CFP hopeful No. 5 Oklahoma beats No. 9 Texas for Big 12", "author": "stephen hawkins, ap sports writer", "date": "ARLINGTON, Texas \u0097 Dec 1, 2018, 4:56 PM ET"},
{"url": "https://abcnews.go.com/Sports/wireStory/latest-championship-saturday-starts-texas-td-59544264", "body": "\n\nThe Latest on college football's championship Saturday (all times Eastern):\n5:50 p.m.\nMemphis has played UCF close twice during the Knights' 24-game winning streak, and the Tigers are giving the defending AAC champions fits again.\nRunning back Darrell Henderson has rushed for three touchdowns and also thrown for one to help Memphis to a 38-21 halftime lead in the ACC title game in Orlando, Florida.\nThe nation's second-leading rusher has carried 10 times for 207 yards, including scoring bursts of 62, 12, and 82 yards. He tossed a 4-yard TD pass to Sean Dykes and also had a 40-yard TD run called back because of a holding penalty.\nThe Tigers have 336 yards rushing at the half, 402 yards overall.\nDarriel Mack made his second start of the season for UCF, filling in for injured starter McKenzie Milton.\nMack lost two first-quarter fumbles, setting up Henderson's second touchdown and a field goal. The red-shirt freshman also fumbled into the end zone from inside the Memphis 1, however teammate Michael Colubiale recovered for a UCF touchdown in the second quarter.\n— Reporting by Fred Goodall in Orlando, Florida\n———\n5:40 p.m.\nGeorgia and Alabama are trading major blows in the SEC championship game.\nJake Fromm's second touchdown pass of the game, an 11-yarder to D'Andre Swift, to give No. 4 Georgia a short-lived 21-7 lead over No. 1 Alabama in the Southeastern Conference championship game.\nWith the Crimson Tide facing its biggest deficit of the season, Josh Jacobs then recovered his own fumble in the end zone to cut the Bulldogs' lead to 21-14 going into halftime. Jacobs set up the 1-yard TD with a 59-yard burst.\nBoth teams are playing like there is a spot in the College Football Playoff on the line — because it is.\nFromm found tight end Isaac Nauta for a 20-yard scoring pass in the first quarter.\n— Reporting by Charles Odum in Atlanta\n———\n5:00 p.m.\nOn the first play of the second quarter in the SEC championship game, Josh Jacobs scored from a yard out for No. 1 Alabama to make it 7-7 against No. 4 Georgia. The winner in Atlanta will go to the playoff.\n———\n4:55 p.m.\nUAB, in its second season after the program was restarted, has won the Conference USA championship with a 27-25 victory at Middle Tennessee. The Blazers had their program shuttered after the 2014 season, but restarted last year under coach Bill Clark. Earlier this week, UAB signed Clark to a new five-year contract.\nUAB will head to a bowl game 10-3.\n———\n4:50 p.m.\nAlabama is trailing for only the second time this season.\nJake Fromm hit Isaac Nauta for a 20-yard touchdown to take a 7-0 advantage with 3:08 left in the first quarter of the SEC championship game in Atlanta.\nThe Crimson Tide had only fallen behind once before, when Mississippi scored a 75-yard touchdown pass on the first play of the game. Alabama trailed for just 70 seconds before tying the game. Alabama ended up winning that game 62-7 and has beaten every opponent by at least 22 points.\n———\n4:25 p.m.\nAlabama quarterback Tua Tagovailoa went into the medical tent after the first series of the SEC championship game in Atlanta.\nTagovailoa, who has battled a right knee injury the past few weeks, appeared to twist his left ankle and seemed to be limping after a sack. But after being evaluated, he was jogging along the Alabama sideline.\nRegarded as the Heisman Trophy front-runner, Tagovailoa was intercepted at the goal line by Richard LeCounte on the next play. Tagovailoa came into the game with 36 touchdowns and just two interceptions.\n— Reporting by John Zenor in Atlanta\n———\n4:05 p.m.\nKyler Murray and No. 5 Oklahoma made their final case for selection into the College Football Playoff with a 39-27 victory against No. 9 Texas in the Big 12 title game.\nThe Sooners rallied from a first-half deficit and their beleaguered defense played its best game in weeks. The Sooners got a safety in the fourth quarter that swung the game in their favor.\nOklahoma entered championship Saturday fifth in the CFP rankings, poised to possibly move into the fourth and final playoff spot with a victory and Georgia loss to No. 1 Alabama in the SEC championship game. How the Bulldogs-Crimson Tide goes will play a huge part in putting the playoff puzzle together for the selection committee. Georgia-Alabama was about to kick off in the one conference title game where both teams had playoff hopes.\nOhio State also had to be scoreboard watching the Big 12. The Buckeyes were sixth in the playoff rankings, going into their Big Ten title game against Northwestern.\nMurray, in his last chance to impress Heisman Trophy voters, threw for 379 yards and three touchdowns.\n———\n3:55 p.m.\nThe American Athletic Conference championship game is underway in Orlando, Florida, where No. 7 UCF and Memphis are playing for the title for the second straight year.\nKnights star quarterback McKenzie Milton is not playing after suffering a serious leg injury last week at South Florida, however that's not stopping the junior from Kapolei, Hawaii from having a presence in Spectrum Stadium.\nSome in the crowd of more than 44,000 arrived in Hawaiian shirts and fans entering the sold-out stadium also were given colorful leis to wear in tribute to the two-time AAC offensive player of the year, who threw for 2,663 yards and 25 touchdowns to help UCF get back to the league title game.\nIt's a rematch of last year's AAC championship game, which UCF won 62-55 in double overtime. The Knights and Tigers also played a close game in Memphis earlier this season, with UCF rallying from a 16-point deficit to win 31-30.\nMilton injured on Nov. 23. He has been released from a Tampa hospital and returned home to Orlando, where he was expected to watch the game on television with his parents.\n— Reporting by Fred Goodall in Orlando, Florida\n———\n3:30 p.m.\nOklahoma's defense, of all things, came through with a game-changing play against Texas in the Big 12 championship. After the Longhorns forced a turnover to give the ball back to the offense deep in its own territory, the Sooners' Tre Brown sacked Texas quarterback Sam Ehlinger in the end zone for a safety to make it 32-27.\nOklahoma got the ball back, too and was trying to put together a drive to kill the clock and salt away their fourth straight Big 12 title.\n———\n3:25 p.m.\nThe American Athletic Conference championship between unbeaten No. 7 UCF and Memphis is close to kicking off and the Knights have already had some good news.\nInjured quarterback McKenzie Milton has been released from the hospital and will watch the game at home with his family in Orlando. Milton suffered a severe right leg injury that caused nerve damage. But his family has said he is recovering well and will have reconstructive knee surgery after at a later date.\nThe Knights have won 24 straight games.\n———\nAppalachian State won the first Sun Belt Conference championship game, beating Louisiana-Lafayette 30-19 in Boone, North Carolina. The Mountaineers head into bowl season 10-2, but will they be able to hang on to coach Scott Satterfield? He has been reported as a prime candidate for the vacant Louisville job.\n———\n3:15 p.m.\nOklahoma will be without star receiver Marquise Brown in the fourth quarter of the Big 12 championship game against No. 9 Texas.\nBrown, nicknamed Hollywood, is the Sooners leading receiver and an All-America contender. Oklahoma athletic training staff was working on Brown's ankle and foot as he sat on the bench. He was carted off to the locker room.\nOklahoma took a 30-27 lead on Austin Seibert's field goal with 12:37 left that ricocheted off the upright.\nThe Red River rematch drew a record crowd to the Big 12 championship game. The announced attendance for the sold-out game between No. 5 Oklahoma and No. 9 Texas was 83,114 at AT&T Stadium, the home of the NFL's Dallas Cowboys.\nBig 12 officials said it is the biggest crowd ever for a Power Five championship game. The previous record was 83,091 for the inaugural SEC championship game at Legion Field in Birmingham, Alabama. Oklahoma and Texas played a game outside the State Fair of Texas for the first time since 1929. Those games are at Cotton Bowl Stadium, where there was a sold-out crowd of 92,300 when they played eight weeks a\n———\n2:55 p.m.\nNo. 9 Texas has tied No. 5 Oklahoma at 27-all in the Big 12 championship game after Sam Ehlinger's 5-yard TD pass to Lil'Jordan Humphry with 2:44 left in the third quarter. The Longhorns missed the extra point that would have put them back in the lead.\nThe Sooners went ahead 20-14 right before halftime on Kyler Murray's 6-yard TD pass to Grant Calcaterra, and then extended their lead on Trey Sermon's 5-yard TD run to start the second half.\nCollin Johnson, whose 169 yards receiving are already a Big 12 championship game record, had a 27-yard TD from Ehlinger on the first Texas drive of the second half when he also had catches of 25 and 21 yards. Oklahoma then punted, setting up the Longhorns' latest scoring drive.\nThe teams headed to the fourth quarter tied.\n———\n1:55 p.m.\nNo. 5 Oklahoma has a 20-14 halftime lead over No. 9 Texas in the Big 12 championship game after Kyler Murray's second TD pass, a 6-yarder to Grant Calcaterra with 18 seconds left in the first half.\nThe Sooners went 80 yards in five plays in a 41-second drive without any timeouts. They had used all three of their timeouts in the first quarter to avoid delay game penalties.\nMurray is 12-of-17 passing for 203 yards.\nSam Ehlinger, who has 169 yards passing, and scored the Texas TDs on runs of 16 and 3 yards.\n———\n1:15 p.m.\nSam Ehlinger's second touchdown run early in the second quarter has No. 9 Texas up 14-6 on No. 5 Oklahoma. The Sooners have had to settle for two field goals after trips into the red zone.\nThe Sooners have scored at least 45 points in eight straight games.\nOklahoma is trying to secure its fourth straight Big 12 title and third appearance on the College Football Playoff.\n———\n12:55 p.m.\nBig 12 Commissioner Bob Bowlsby knows there's no guarantee No. 5 Oklahoma will get into the College Football Playoff with a win in the Big 12 title game, even if Georgia loses to Alabama in the SEC championship game.\nAsked before Saturday's title game if he was comfortable that the Sooners would get into the four-team playoff with a win over No. 9 Texas, Bowlsby responded, \"No.\"\nThe Sooners are fifth in the latest CFP standings, behind Alabama, Clemson, Notre Dame and Georgia. Ohio State, which is sixth, plays Northwestern in the Big Ten championship game Saturday night.\n\"I think the human nature being what it is, I think the last thing you see makes a lot of difference, and I don't think it's inconceivable that Ohio State could win big and they could jump,\" Bowlsby said.\n\"I don't think that's as likely as it might have been before Tuesday (and the latest CFP ranking) because there's the talk about the strength of schedule and OU's strength of schedule is going to do nothing but get stronger by this,\" Bowlsby said. \"And chances are if Ohio State beats Northwestern, chance are Northwestern may fall out of the Top 25, so that would further weaken the strength of schedule.\"\nIn the first year of the CFP in 2014, Ohio State won the Big Ten championship game 59-0 and took the fourth playoff spot ahead of Big 12 co-champions TCU and Baylor.\n———\n12:15 p.m.\nLess than four minutes into the Big 12 championship game, the first of four Power Five title contests on Championship Saturday, No. 9 Texas has a touchdown and a 7-0 lead against No. 5 Oklahoma.\nThe Sooners have allowed at least 40 points in each of their last four games and won them all, a first in college football history. But their high-scoring offense led by quarterback Kyler Murray still has Oklahoma in position for a College Football Playoff appearance.\n———\n3 a.m.\nBefore the College Football Playoff field is set, there is one last chance to make a case to the selection committee.\nNo. 5 Oklahoma and No. 6 Ohio State both need to win Saturday — and they should both be rooting for Alabama.\nThe Sooners enter Championship Saturday with a chance to make the playoff for a second straight season. Oklahoma faces archrival Texas for the Big 12 title in the first of four Power Five championship games that will decide the four-team playoff field that will be revealed Sunday.\nOhio State plays Northwestern in the Big Ten championship. No. 1 Alabama faces No. 4 Georgia for the SEC title and a win by the Crimson Tide could open the door for the Sooners or Buckeyes. No. 2 Clemson is heavily favored against Pittsburgh in the ACC championship game.\nIn all, there are nine championship games on Saturday: Besides the SEC, ACC, Big Ten and Big 12 games, titles will be settled in the Sun Belt (Louisiana-Lafayette at Appalachian State), Conference USA (UAB at Middle Tennessee), American Athletic (Memphis at UCF), the SWAC (Southern at Alcorn State) and the Mountain West (Fresno State at Boise State).\n———\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP—Top25 ", "title": "The Latest: Memphis leads UCF 38-21 in AAC title game", "author": "the associated press", "date": "Dec 1, 2018, 5:53 PM ET"},
{"url": "https://abcnews.go.com/Sports/wireStory/chiefs-set-oakland-game-hunt-wonders-59544491", "body": "\n\nKareem Hunt went from the Kansas City Chiefs' practice field to looking for a job in about six hours, a spectacular fall for the NFL's reigning rushing champion.\nThe Pro Bowl running back had been preparing for Sunday's game at Oakland when a months-old video surfaced online. The footage from a Cleveland hotel security camera showed Hunt shoving and kicking a woman, with police ultimately responding. No charges were filed.\nThe Chiefs immediately sent Hunt home as the TMZ video rippled across social media. An organization that prides itself on providing second chances said in a statement late Friday it had released the 23-year-old star. The team was traveling Saturday.\nThe NFL had no comment Friday night beyond saying Hunt was on the commissioner's exempt list, meaning he can't play or attend games while the league investigates.\nThe question now for both the Chiefs and Hunt is simple: What's next?\nThe Chiefs (9-2) are barreling toward the No. 1 seed in the playoffs, and the loss of their leading rusher is substantial. Hunt already had run for more than 800 yards and had 14 total touchdowns, helping Kansas City form one of the league's most dynamic offenses.\nHis ability to churn out yards on the ground helped the Chiefs put away several games. His ability to catch passes out of the backfield had been just as useful.\nYet the falloff to Spencer Ware isn't that significant.\nThe Chiefs' backup was the unquestioned starter heading into last season, even after the team made Hunt their third-round pick. It wasn't until Ware — whose skill set closely mirrors that of Hunt — went down with a season-ending knee injury in the preseason that the rookie took over.\n\"There was a question whether he would be able to come back from that injury. It was a pretty tough injury to come back from,\" Chiefs coach Andy Reid said recently. \"The last couple weeks he has played good . You can see where he is more confident each week here.\"\nThe Chiefs are also confident in backups Damien Williams and Darrel Williams. And with a soft schedule down the stretch, including two games against the Raiders, there is plenty of time for their offense to adjust to life without Hunt in the backfield.\nSo that is what's next for the Chiefs. What happens to Hunt?\nThe Chiefs and the NFL knew what happened in February in Cleveland, and the organization spoke to Hunt on several occasions before handling discipline internally. But neither the team nor the league had seen the video before it became public Friday.\nThe NFL made multiple attempts to obtain it, a person familiar with the case told The Associated Press, speaking on condition of anonymity because of the ongoing investigation. The hotel informed the league that corporate policy allowed the video to be given only to law enforcement.\nThe NFL then contacted Cleveland police, the person said. Police declined to provide the video. Police and hotel officials have not commented.\nThe video showed Hunt lunging toward a woman and several others in a hotel hallway, and the player being restrained several times before knocking two people down. Two police reports were filed in which each person accuses the other: Hunt is listed as the suspect in one; a woman, Abigail Ottinger, is the suspect in the other.\nIn its grainy and graphic footage, the video brought a new dimension to developments, showing that what Hunt had told the Chiefs was not the case. The team said he was \"not truthful in those discussions.\"\nThe matter brought immediate comparisons to the video of Ravens running back Ray Rice punching a woman in an elevator, which ultimately led to a long legal saga that ended with him never playing in the NFL again.\nThe big difference between Rice and Hunt, though, is this: Rice was on the downward side of his career while Hunt was on the ascent.\nBeing on the exempt list does not prevent another team from taking a chance on a player. That was the underlined when the Washington Redskins signed linebacker Reuben Foster, who had been cut last week after he was arrested on suspicion of domestic violence.\nThe Redskins faced harsh public criticism, and there will no doubt be a similar outcry if a team signs Hunt. But balancing such opposition against the benefits of a young star in his prime is a delicate decision for team executives.\nHunt issued a brief apology late Friday, a small first step toward getting another chance. But as the Chiefs get ready to play in Oakland, Hunt will be watching on television.\nThere are many more steps before Hunt takes the field again.\nIf it ever happens.\n———\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP—NFL ", "title": "Chiefs set for Oakland game while Hunt wonders what's next", "author": "dave skretta, ap sports writer", "date": "KANSAS CITY, Mo. \u0097 Dec 1, 2018, 3:02 PM ET"},
{"url": "https://abcnews.go.com/Sports/wireStory/norvells-28-points-rallies-zags-past-creighton-103-59547680", "body": "\n\nGonzaga's Zach Norvell Jr. got off to a slow start against Creighton for the second year in a row. Like last year, he finished with a flurry.\nNorvell scored 23 of his career-high 28 points in the second half, and top-ranked Gonzaga wiped out an early double-digit deficit and beat Creighton 103-92 on Saturday.\nNorvell's shot was off throughout the first 20 minutes. Coming out of halftime, coach Mark Few drew up a play just for him. Norvell took a pass from Rui Hachimura, went hard to the basket and converted a three-point play. He scored nine of the Zags' first 11 points of the half.\n\"When he makes his first one,\" Few said, \"it's game on.\"\nNorvell has had a habit of starting slowly. Gonzaga, missing two key players because of injury, needed all the points he could provide against a high-scoring Creighton team.\n\"I wanted to be aggressive starting off the half, get myself a chance to get going,\" Norvell said, \"and it went well.\"\nLast year, Norvell scored all 21 of his points in the second half in a 91-74 come-from-behind victory over the Bluejays in Spokane, Washington.\n\"We played 40 minutes of pretty good  against them the last two years,\" Creighton coach Greg McDermott said. \"Unfortunately, those 40 minutes didn't happen the same day. They are a problem to get stopped.\"\nThe Bulldogs (8-0), who took over the No. 1 ranking this week after beating Duke in the Maui Invitational, overcame a boisterous crowd of more than 18,000 at the CHI Health Center to win in their first true road game.\n\"It was just a great basketball game, and I'm not saying that just because we ended up on top,\" Few said. \"It was really high-level play going on, high-level shot-making. Creighton's offense is really something special.\"\nNorvell said the Zags can build off the win.\n\"It was big-time for us,\" he said. \"Coming into an  like this with a good crowd, a well-coached opponent and knowing they would play really hard, we knew it was going to be a battle. We wanted to take the fight to them. It didn't go well for us the first half. They made some tough shots. We were able to stay with it, stay poised and confident, and we were able to get a win.\"\nThe Zags, down 48-41 at halftime, took their first lead since early in the game on a Corey Kispert 3-pointer that put them up 66-65. They held Creighton (6-2) scoreless for nearly four minutes in the middle of the second half while going on a 12-0 run to go up 84-73. Norvell hit two 3-pointers and a layup during the spurt while Creighton missed five shots and turned over the ball three times.\n\"He's a rhythm guy, he's a rhythm guy in practice,\" Few said of Norvell. \"He missed a couple real easy shots in the first half. You can always tell the way it's coming off his hand. It takes a special, confident, courageous player to keep taking shots like that. He's definitely that.\"\nNUMBERS TO NOTE\nGonzaga's Brandon Clarke added 27 points and 10 rebounds and Hachimura had 22 points and 11 boards for the Bulldogs. Josh Perkins had 13 points to go with a career-high 13 assists. ... Norvell was 1 for 6 on 3-pointers in the first half and 5 for 11 in the second. ... The Zags upped their scoring average to 98.4 points, second in the nation. ... Ty-Shon Alexander led the Bluejays with 27 points. Damien Jefferson had 15 and Martin Krampelj 10.\nTHE BIG PICTURE\nGonzaga: With Geno Crandall (hand) and Killian Tillie (ankle) out because of injuries, this was a major test. The Zags had trailed for only 23 of a possible 280 minutes coming into the game, and they had to play from behind most of the afternoon until they took control in the last 10 minutes.\nCreighton: The Bluejays fell short of knocking off a No. 1 opponent for the first time in three tries. But they are much further ahead of where most expected them to be after getting picked ninth in the 10-team Big East.\nUP NEXT\nGonzaga hosts Washington on Wednesday.\nCreighton visits Nebraska on Dec. 8.\n———\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP—Top25 ", "title": "Norvell's 28 points rallies No. 1 Zags past Creighton 103-92", "author": "eric olson, ap sports writer", "date": "OMAHA, Neb. \u0097 Dec 1, 2018, 5:33 PM ET"},
{"url": "https://abcnews.go.com/Sports/wireStory/nats-work-bryce-harper-looms-offseason-59546909", "body": "\n\nEverywhere Washington Nationals first baseman Ryan Zimmerman goes these days, the same topic arises: What is going to happen with free agent outfielder Bryce Harper?\n\"As if they think — I guess because I've been here forever — I know all the answers to everything,\" Zimmerman said Saturday at Nationals Park during the club's annual fan festival. \"Yeah, you get that question quite a bit.\"\nAs much as Washington general manager Mike Rizzo already has done to try to improve a roster that flopped in 2018, that is the essential issue that is going to loom over the offseason until it's resolved.\nHarper was drafted No. 1 overall by the Nationals in 2010, made his major league debut as a teen, won the NL Rookie of the Year award in 2012, was a unanimous selection as NL MVP in 2015 — and now could be gone for good at age 26.\n\"Whatever team he's on is a better team. He's one of the better players in the game. A lot of us would love to have him back here. I don't think there's anyone that wouldn't like to have him back,\" Zimmerman said. \"But there's a lot of different factors that go into that. It's a complicated situation.\"\nWashington, which went 82-80 and missed the playoffs, made a late-season offer to Harper that was not accepted, which was no surprise.\n\"They haven't showed their hand either way, as far as what their timeline is,\" Rizzo said. \"I think their timeline is: When they get the deal they feel comfortable with, I think they're going to move. I don't think there's anything urgency on their part. I think when they get something they like, it'll probably happen.\"\nUntil then, Rizzo is making moves to shore up his team.\nThat doesn't include the outfield, though: The Nationals already have Juan Soto, who was the runner-up for NL Rookie of the Year, along with Adam Eaton, top prospect Victor Robles and Michael A. Taylor.\nAs for Harper's future, Robles said: \"Everyone asks about that. A lot.\"\nRizzo has added a pair of catchers, trading with the Cleveland Indians for AL All-Star Yan Gomes on Friday without relinquishing a top prospect and signing free agent Kurt Suzuki to a $10 million, two-year deal last week.\nHe brought in a couple of back-end-of-the-bullpen relievers, signing Trevor Rosenthal, a free agent coming off reconstructive elbow surgery, and acquiring Kyle Barraclough from the Miami Marlins.\nAnd he joined Nationals owner Mark Lerner in meeting recently with free agent starting pitcher Patrick Corbin, a left-hander who went 11-7 with a 3.15 ERA as an NL All-Star for the Arizona Diamondbacks in 2018.\n\"We go into the offseason with a checklist every year. We've checked a few things off so far, but we're far from finished. And I think that the Bryce situation and filling some of the other things that we're trying to do are independent of each other,\" Rizzo said. \"We've always been an organization that ownership has given us the resources to do what we need to do to build a championship-caliber club, and I don't see that changing.\"\nNOTES: Asked about how his long-term deal could expire after next season, unless the Nationals pick up an $18 million club option for 2020, Zimmerman said he doesn't anticipate \"having any problems coming to an agreement moving forward.\" Added the 34-year-old Zimmerman: \"I still would like to get compensated fairly, but it's not like I'm going to go somewhere else and play for an extra couple bucks. I don't think it's any secret I would like to finish here.\" ... 2B/OF Howie Kendrick will be \"full-go at spring training,\" Rizzo said. Kendrick tore his right Achilles tendon in May and missed the rest of last season. ... Asked whether the Nationals will make a push to sign 3B Anthony Rendon to a new contract this offseason, Rizzo replied: \"I think we should. And I think we have. And I think we will continue to do so. He's a guy that we drafted, signed and developed and he's one of our own. He's a terrific player that nobody talks about.\"\n———\nMore AP baseball: https://apnews.com/MLB and https://twitter.com/AP—Sports ", "title": "Nats have done work, but Bryce Harper looms over offseason", "author": "howard fendrich, ap sports writer", "date": "WASHINGTON \u0097 Dec 1, 2018, 3:55 PM ET"},
{"url": "https://abcnews.go.com/Sports/wireStory/chiefs-raiders-seahawks-49ers-top-nfl-rivalries-sour-59542856", "body": "\n\nTwo of the NFL's most intense rivalries have turned sour.\nWhen the Chiefs visit the Raiders in a series that dates to the AFL and has been as good as any in pro , the oddsmakers see Oakland (2-9) getting routed — at home — by Kansas City. Most of America sees it that way, too.\n\"I know this, when it comes to Chiefs and Raiders, it doesn't matter records,\" said Chiefs coach Andy Reid, whose team is 9-2. \"It's one of those deals and you better come ready to play against a Jon Gruden-coached  team. That's the way I am approaching it with the guys right now. I just think that's very important.\"\nSince the Raiders moved back from Los Angeles to Oakland in 1995, there's been only one season when both clubs had winning records (2016). The rivalry has been less heated since Marty Schottenheimer left as Kansas City coach in 1998 and Raiders owner Al Davis died in 2011. But this gap is success is ridiculous.\nA more recent rivalry to savor has been San Francisco vs. Seattle. With the Seahawks (6-5) retooling but still competitive, and the 49ers (2-9) perennially rebuilding, that magic seems gone. Indeed, the league flexed this game off prime time.\n\"We had some great battles over the years,\" says Seahawks coach Pete Carroll, specifically referring to the matchups with Jim Harbaugh when he led the 49ers. \"If that's what you guys want to call a rivalry, I'm not trying to minimize that part, it's just that isn't the way I talk and act and think about it. The better the other team is, the more it brings out the best you have, and I love that.\"\nThe weekend began Thursday night with Dallas' 13-10 home victory over New Orleans. Ezekiel Elliott scored the only Dallas touchdown and the Cowboys (7-5) stifled Drew Brees and the Saints (10-2), ending New Orleans' 10-game winning streak. New Orleans failed to score in the first half, with Brees throwing for 39 yards.\nThere are no more byes on the schedule.\nKansas City (10-1) at Oakland (2-9)\nIt's a bit complicated, but a Chiefs win and losses by Miami, Tennessee, Houston, Indianapolis, Baltimore and Cincinnati in certain combinations hand KC a playoff berth. Not that anyone doubts one is coming.\nThe Chiefs have won six of seven in this series and Reid's teams are 16-3 coming off a bye.\nHere's a weird stat: Oakland stands fifth in the NFL with 34 points on opening drives. It's third worst with 1.32 points per drive after that.\nSan Francisco (2-9) at Seattle (6-5)\nMost intriguing here is Richard Sherman now wearing a 49ers jersey. The star defensive back for seven seasons in Seattle hasn't done much in San Francisco: Sherman had 32 picks for Seattle, most in the NFL during that span. He has zero interceptions and four passes defensed this season.\n\"It's different. Just the dynamic of the NFC West has changed,\" Sherman says. \"It's changed a few times throughout the years. Early on when I first came in the league, San Fran was at the top and winning the division and went to a few NFC championships. In the middle of that, Seattle came up and was battling with Frisco, and for one crazy year Arizona came out of nowhere and had a really good season and made it to the NFC championship.\n\"There was a lot more teeth to the rivalry during those middle years for a number of reasons because there were several story lines. Since then, coaching changes have happened here, personnel changes have happened elsewhere, and the Rams have become incredible in the division and are playing really good football. So a lot has changed.\"\nThe Seahawks have won eight straight and 10 of the past 11 vs. the 49ers. Seattle, which plays four of its final five at home — the other game is at the Niners — are 26-13 in regular-season games in December/January under Carroll.\nLos Angeles Chargers (8-3) at Pittsburgh (7-3-1)\nThe scoreboard might explode at Heinz Field as Class of 2004 QBs Philip Rivers and Ben Roethlisberger light it up.\nRivers set an NFL record for highest completion rate (96.6 percent) and tied the mark for consecutive completions (25) in last week's rout of Arizona. He has multi-TD games in every outing this season, but will be without running back Melvin Gordon (knee).\nRoethlisberger's 97-yard touchdown pass to JuJu Smith-Schuster last week gave him four 90-plus yard passes, most in NFL history. He threw for 462 yards in the loss at the Broncos, his sixth game of 450-plus yards. No other QB in NFL history has more than four.\nPittsburgh has won four of the past five meetings and is 15-3 at home against the Chargers.\nNeither team can afford a stumble as it approaches likely postseason berths. LA can't fall further behind KC in the AFC West, and the Steelers have hopes of a first-round bye.\nMinnesota (6-4-1) at New England (8-3)\nMore records are within Tom Brady's reach. With two touchdown passes against Minnesota, Brady would pass Peyton Manning's 579 for the most passing touchdowns in NFL history, including the postseason. He also would beat Brett Favre's 508 for the third-most regular-season touchdown passes.\nWith the Vikings' best cornerback, Xavier Rhodes, leaving last Sunday night with a hamstring issue, stymieing Brady could be a major challenge for Minnesota as it chases NFC North leader Chicago.\n\"I remember when we were going in Cincinnati I'm watching him pregame and he was just throwing these darts,\" Vikings coach Mike Zimmer says of Brady, \"and I'm like, 'Oh my gosh, we're in trouble today.' But his accuracy, I think he sees so many things now, I think with the experience. I don't know that he's changed all that much.\"\nWashington (6-5) at Philadelphia (5-6), Monday night\nAmong the many so-so teams in playoff contention are the Redskins, operating without their No. 1 quarterback, Alex Smith, and the defending Super Bowl champion Eagles, with a torn-up secondary.\nColt McCoy had 268 yards passing, two touchdowns and three interceptions last week. Something to look for: Adrian Peterson needs two TDs to pass Jim Brown (106) for fifth most in NFL history.\nPhilly's secondary is ravaged by injuries, so a strong pass rush likely is needed.\nLos Angeles Rams (10-1) at Detroit (4-7)\nThe Rams have their eyes on winning out to put the heat on New Orleans for overall home-field advantage in the NFC. First up, a pair of NFC Central opponents — at Chicago next week is the tougher test.\nLos Angeles clinches the NFC West with a win or Seattle loss. Todd Gurley leads the league with 1,484 scrimmage yards and 17 scrimmage TDs, and DT Aaron Donald has been practically unblockable at times. He had two strip-sacks in the win over the Chiefs.\nThe Lions have lost four of five as Matthew Stafford has thrown for three TDs and four INTs in the past four games.\nChicago (8-3) at New York Giants (3-8)\nNFC North-leading Chicago aims for a sixth straight win; the Bears won three times in 12 days, once without starting quarterback Mitchell Trubisky. Chase Daniel started against the Lions on Thanksgiving, going 27 for 37 for 230 yards with two touchdowns and no interceptions.\nBut it's defense that marks these Bears, hardly a surprise. They lead the NFL with fewest first-half points allowed (64), are tops with 20 interceptions and are tied for the league lead with 16 forced fumbles.\nGiants RB Saquon Barkley is one of four rookies in NFL history with touchdowns rushing and receiving in consecutive games. He has 100-plus yards from scrimmage in 10 of 11 games and Barkley ranks third in the NFL with 1,410 yards from scrimmage. He probably will find it tough going Sunday.\nCleveland (4-6-1) at Houston (8-3)\nHouston is on quite a roll with eight consecutive wins, has beaten Cleveland four straight times and six of the past seven meetings.\nStill, the Browns are dangerous under interim coach Gregg Williams and with top overall draft pick Baker Mayfield playing well. Cleveland ended a 25-game road losing streak last week at Cincinnati as Mayfield threw a season-high four touchdown passes.\nMayfield must keep a watch for J.J. Watt, whose sensational comeback season peaked with nine tackles, 1½ sacks and a forced fumble last Monday night. Watt, tied for second in the NFL with 11½ sacks, had three tackles for losses, one sack, forced and recovered a fumble and had a TD reception in his last game against Cleveland in 2014.\nIndianapolis (6-5) at Jacksonville (3-8)\nIndy is up, Jacksonville is awful.\nA victory would give the Colts their first six-game winning streak since opening their 2009 AFC championship season 14-0. Andrew Luck has a TD pass in an NFL-best 34 straight games and three or more TDs in eight consecutive games, tying Peyton Manning for No. 2 all time.\nThe Jaguars have dropped seven straight, fired offensive coordinator Nathaniel Hackett and benched QB Blake Bortles. Cody Kessler was 0-8 as Cleveland's starter in 2016.\nJacksonville is without RB Leonard Fournette, suspended one game for leaving the bench and instigating a fight in Buffalo.\nDenver (5-6) at Cincinnati (5-6)\nThe Bengals have lost five of six and now are without Andy Dalton (thumb); third-year quarterback Jeff Driskel gets his first NFL start Sunday.\nGround games could be key here. Broncos RB Phillip Lindsay ranks second among NFL rookies with 780 yards rushing, and with Dalton out, Joe Mixon — 89 yards vs. the Browns — should be busy toting the ball for Cincinnati.\nBroncos star linebacker Von Miller has sacks in six straight games.\nBaltimore (6-5) at Atlanta (4-7)\nOnly the sixth meeting, with Baltimore's 19-13 OT victory in Atlanta in 1999 the only win by a visiting team.\nBaltimore owns the NFL's top-ranked defense, allowing a league-low 18 points per game, and has found a winning formula on offense as undrafted rookie Gus Edwards has rushed for at least 100 yards in two straight games. Rookie QB Lamar Jackson has been dynamic on the ground while Joe Flacco heals a hip injury.\nThe highly disappointing Falcons have their second three-game losing streak this season, but Matt Ryan needs two completions to pass Carson Palmer for 11th on the career list, and has topped 300 yards passing and a 100 QB rating in five of the past six games.\nCarolina (6-5) at Tampa Bay (4-7)\nCarolina's three straight losses endanger its playoff chase. Don't blame RB Christian McCaffrey, who had 125 yards rushing, 112 receiving for a club-record 237 scrimmage yards and two TDs last week vs. Seattle. Top draftee D.J. Moore has 17 receptions for 248 yards in the past two games.\nBucs DE Jason Pierre-Paul has 10½ sacks.\nNew York Jets (3-8) at Tennessee (5-6)\nFor Tennessee to have any thoughts about making the postseason, it must win games such as this. The Jets have lost five in a row and other than placekicker Jason Myers, offer little resistance. Myers has five field goals of 55 yards or longer this season, most by any kicker since 2000.\nThe Titans have won 13 of their past 16 home games and do a few things pretty well. They have 56 total penalties, fewest in the league, and have allowed 25 TDs, tied for fifth fewest in the NFL.\nArizona (2-9) at Green Bay (4-6-1)\nNot much to watch with these also-rans. Cardinals star Larry Fitzgerald needs four catches to pass Hall of Famer Jerry Rice (1,281 with 49ers) for most receptions in NFL history with one team. Fitzgerald has scored in all five of his previous games against the Packers.\nPackers WR Davante Adams has a career-high 1,022 yards receiving, scoring at least 10 TDs for a third straight season.\nBuffalo (4-7) at Miami (5-6)\nDon't look for a scoring spree here: Buffalo ranks 31st in offense, Miami is 28th.\nAlthough the Bills have topped 300 yards in the past two games after failing to do so in the first six, their passer rating of 58.9 is worst in the NFL. They have been outscored by 111 points.\nMiami does have regular QB Ryan Tannehill back from a shoulder injury. He has won his past seven home starts.\n———\nMore AP NFL: https://apnews.com/tag/NFL and https://twitter.com/AP—NFL ", "title": "Chiefs-Raiders, Seahawks-49ers: When top NFL rivalries sour", "author": "barry wilner, ap pro football writer", "date": "Dec 1, 2018, 10:53 AM ET"},
{"url": "https://abcnews.go.com/Sports/wireStory/column-keys-turnarounds-seahawks-colts-texans-59522641", "body": "\n\nTurn back the clock to September. What do you see if you root for the Colts, Texans and Seahawks?\nUgliness. Losing. Little hope.\nIt's now after , and Houston l eads the AFC South, with Indianapolis in hot pursuit. Seattle has stamped itself as a wild-card contender in the NFC, and an opponent most teams would like to avoid.\nAll three have made impressive turnarounds that could become memorable should they lead to the playoffs — and January success.\nSo how does it happen? Indy was 1-5 and now is 6-5. Seattle had two dirty defeats to open the schedule and was headed down a long losing path. Houston went 0-3, yet has become the first team to win eight straight after such a weak start.\n\"There is just a real upbeat aura about this team,\" says Seahawks coach Pete Carroll, who majors in upbeat and is doing one of the best jobs of his distinguished career.\n\"They're real hungry to learn, they're hungry for the challenges,\" he added. \"They've just been real competitive throughout and they've enjoyed the challenges. They have not allowed themselves to go downward at any time. They keep looking to the future and what's up and what's coming. It's just been a really good group to work with.\"\nSounds like what's going on in Houston.\n\"You just have to believe,\" explains defensive end J.J. Watt, who majors in believing — and is in the midst of a spectacular comeback season. \"A lot of it comes down to belief, remaining positive even in a difficult situation and believing in yourself, and believing in each other, and knowing that you can turn it around.\n\"I think sometimes ... you're 0-3 or you're in a tough situation, you look around and you're like, 'Maybe that's just us.' I think we all in that situation this year knew that wasn't us. I think we knew we had the players in the room and the ability to play a lot better than we did and to win those games. So, I think it's easy to believe when you know that about your guys.\"\nThe main guy in Indianapolis has been Andrew Luck, who in strange circumstances never fully explained, missed the entire 2017 season with a shoulder injury. Like Watt, he's having a monster of a comeback year.\nFolks in Indy cite coach Frank Reich — a second choice remember, after Josh McDaniels reneged on his deal with the Colts — playing to win in tight situations, such as the overtime loss to the Texans — as being a turning point.\n\"I think Frank has done a great job of keeping us just focused at the task at hand, whether we were losing games, winning games (or) whatever it is,\" Luck says.\n\"The approach has been the same. So in that department, really nothing has changed. We've just come in and try to make the most out of each day. I know it sounds cliché, but it's what's working for us. That's where our focus needs to stay. I think it is and we will fight against letting our focus go elsewhere.\"\nThe key to winding up with a positive season after a negative start really comes down to faith. Faith in the coaching staff, in the players, in staying healthy enough, and in getting some breaks.\nStay the course, and that course might lead you deep into January. Or beyond.\n\"We will see it down the stretch, for sure, that well-coached teams get better as the season goes along unless they are decimated by injury,\" says Hall of Famer Bill Polian, the guiding force for three winning franchises as a team executive.\n\"The guys that can coach get a handle on their team and then they coach the team they have got as opposed to the team that was on paper prior to training camp. They adjust accordingly and go ahead and figure out how best to maximize their strengths and minimize weaknesses.\"\nThat has been the case particularly in Seattle, where Carroll recognized a ball-control offense and opportunistic defense filled with new faces was the correct approach.\nPolian also emphasizes the need for healthy players.\n\"Guys who heal up and are ready to go who are question marks in training camp,\" Polian points to as critical. \"Andrew Luck, who has never played better football in his life, is completely healthy, ready to go and excited, and has a coach who lets Andrew be Andrew. The offensive line has coalesced thanks to the drafting of Quenton Nelson and the return of Anthony Costanzo. That team is way better than they were at the start of training camp.\n\"And Houston is the same way. It's gotten healthy with the return of Watt and the quarterback (Deshaun Watson), who is there full time, and now that is a different team.\"\nPersonnel changes that have worked also have led to success in all three cities.\nPolian believes the Colts have contenders for both top rookie awards, guard Nelson on offense, linebacker Darius Leonard on defense. New tight end Eric Ebron has 11 touchdown receptions.\nThe Texans obviously have Watt and Watson back, along with linebacker Whitney Mercilus, and third-round cornerback Justin Reid. Adding veteran wideout Demaryius Thomas when Will Fuller tore up his knee is paying off, too.\nFor Seattle, a stable of running backs, from first-round pick Rashaad Penny to second-year player Chris Carson to fourth-year vet Mike Davis has kept the backfield fresh. Second-year receiver David Moore has become a contributor, and the tight ends have picked up the slack with Jimmy Graham gone to Green Bay.\nMost of all, the Legion of Boom has gone bust, but the secondary still has progressed throughout the schedule.\nWe might not be looking at a Super Bowl team from Houston, Indianapolis or Seattle this season. But remember what we were looking at two months ago.\n———\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP—NFL ", "title": "Column: Keys to turnarounds for Seahawks, Colts and Texans", "author": "barry wilner, ap pro football writer", "date": "Dec 1, 2018, 10:38 AM ET"},
{"url": "https://abcnews.go.com/Sports/wireStory/franz-takes-super-race-beaver-creek-snowy-foggy-59547434", "body": "\n\nMax Franz of  conquered the snow and fog Saturday for his first  super-G victory.\nRacing was delayed an hour as course workers cleared a considerable amount of snow from the track. With snowflakes still falling, Franz found just a little more speed in a tightly contested event.\nHe finished in 1 minute, 1.91 seconds, holding off Mauro Caviezel of Switzerland by 0.33 seconds. There was a three-way tie for third among Norwegian teammates Aksel Lund Svindal and Aleksander Aamodt Kilde and 's Dominik Paris. The trio was 0.41 seconds behind.\nIt's the second straight day Caviezel and Svindal wound up on the podium. They finished in the same spots during the downhill.\nFranz won a downhill last weekend at Lake Louise.", "title": "Franz takes super-G race at Beaver Creek on snowy, foggy day", "author": "pat graham, ap sports writer", "date": "BEAVER CREEK, Colo. \u0097 Dec 1, 2018, 4:12 PM ET"},
{"url": "https://abcnews.go.com/Sports/wireStory/austrias-schmidhofer-wins-2nd-straight-lake-louise-downhill-59548142", "body": "\n\nNicole Schmidhofer of  has won a  downhill for the second straight day.\nSchmidhofer was even faster Saturday than she was in Friday's season opener with a time of 1 minute, 47.68 seconds.\nTeammate Cornelia Hutter was second, 0.44 seconds behind. Michelle Gisin of Switzerland was third, 0.47 seconds back.", "title": "Austria's Schmidhofer wins 2nd straight Lake Louise downhill", "author": "The Associated Press", "date": "LAKE LOUISE, Alberta \u0097 Dec 1, 2018, 4:35 PM ET"},
{"url": "https://abcnews.go.com/Sports/wireStory/jets-harrison-overcame-years-bullying-achieve-dreams-59539579", "body": "\n\nJonotthan Harrison has not forgotten a single punch or kick, the brutal pushing and shoving, the sudden tackles to the ground with his classmates piling on top of him.\nThere was also the constant and flat-out mean name calling. And all the laughing. So much laughing — at his expense.\nThe New York Jets center endured years of bullying while growing up in central Florida, but refused to let those painful moments stop him from achieving his goals.\n\"I can get along with anybody,\" Harrison said in an interview with The Associated Press. \"But for whatever reason, people found me to be an easy target to mess with, pick on or whatever, whether they thought it was playful or not.\"\nThe 6-foot-4, 300-pound Harrison hardly looks like the type of guy anyone would dare mess with.\nFrom fifth grade through high school, though, it was a different story — one he often shares in schools on days off from practice to bring awareness to bullying and try to prevent it from happening to other youngsters.\n\"It was a journey and I realized toward the end of high school that it kind of toughened me up on the inside,\" the 27-year-old Harrison said. \"You know, if I could go through all that and still come out on top, so to speak, all those people that bullied me and did whatever, they're still in my hometown. They haven't done anything with their lives, so now I'm very thankful for my parents' guidance growing up and for where it's helped me get to.\"\nHarrison's mother Jennifer and stepfather Robert Vorasky were travel nurses when he was young, so the family often bounced around south Florida. When Harrison reached fifth grade, his parents bought a home in the city of Mascotte in Lake County, Florida, with the intentions of providing stability.\nBut Harrison quickly realized he was in for some major challenges.\n\"I was the only person of my color in my class and they didn't throw racial slurs at me, but coincidentally, we'd go out to recess and everyone would gang up on me on the soccer field,\" he recalled. \"They would trip me, they'd throw the ball at me. Me being an only child, I didn't have any siblings to talk to, didn't have any siblings to toughen me up or anything like that. So, there were times I'd go home emotional to my mom.\n\"It sounds bad, but it is what it is.\"\nIn middle school, Harrison tipped the scales at more than 200 pounds, so he exceeded the weight limit to join athletic teams. Instead, he discovered the school band and played the guitar and French horn. He was pretty good at both, too, but that didn't matter to some of the school's jocks.\n\"It was like, 'Oh, here's this 'big, squishy kid,' let's tackle him and let's pick on him a little bit,'\" Harrison said. \"So, on my way to lunch, I'd get tackled every single day. My books would go flying, I'd get scraped up, my shirt ripped up, whatever.\n\"Everybody would just laugh, and I'd just pick myself up and keep going.\"\nAt South Lake High School, it was more of the same. Some kids also came up with an undesirable nickname: \"Big Baby.\"\n\"They would say, 'Oh, you're just like a big baby,'\" Harrison said. \"It kind of stuck with me all the way through college, but it was a different 'Big Baby' at that point. I eventually became like a cool 'Big Baby,' but at the time, it was belittling and all I wanted to do was fit in.\"\nHarrison would share some stories with his parents, but his mother would occasionally hear from his friends about other troubles with which her son was dealing.\n\"He didn't want to hurt me,\" Jennifer Harrison said in a telephone interview. \"He didn't want to see my pain, too, because I think he realized it made me so sad when he was hurting, too.\"\nShe would frequently address Jonotthan's issues with his teachers and school officials. At home, she provided her son comfort — and valuable advice.\n\"Be greater than your enemies,\" Harrison recalled her telling him. \"Don't stoop down to their level. You could really hurt somebody if you retaliated because you're 200-plus pounds and they're still under 200 pounds.\"\nJennifer Harrison acknowledged it was tough to ask her son to not retaliate. She knew it frustrated him, but she made it clear she understood what he was going through.\n\"I told him, if you fight back, you would just be fueling the fire that these kids are trying to spark in you,\" she said, \"and you don't want that.\"\nInstead, Harrison kept brushing himself off and moving forward.\nHe joined the football team in high school and became a star offensive lineman. That paved his way to a scholarship to the University of Florida.\n\"I honestly believe that is one of the things that motivated him to be such a good football player,\" Jennifer Harrison said. \"That was his license to hit back. Maybe some good came out of it in that way. I saw his passion in football and I just said, 'Wow, he's finally able to hit back legitimately,' and I think that gave him his strength and his oomph in football.\"\nHarrison was also a model student with a double major who graduated with degrees in criminology and anthropology, and set his sights on becoming a homicide detective after his playing days.\n\"It's a pleasure to sit back and watch what he is doing now and how he has overcome that in his life and turn it around into something good,\" Jennifer Harrison said. \"I know it could have turned the other way.\n\"It could have been more negative.\"\nHarrison went undrafted in 2014, but signed with Indianapolis and started 23 games over the next three seasons. He signed with New York last year and played in eight games, including one start, before re-signing with the Jets last offseason.\nHarrison is set to start his third consecutive game at center, and could remain in that spot the rest of the season.\n\"I've had people reach back out and act like everything's cool now,\" Harrison said. \"I'm like, 'Hey, bro. You don't remember? I remember you throwing rocks at me when I rode my bike. I remember when we were playing football and all you guys turned and we got into this huge brawl in my backyard and nobody had my back. I remember all those times.' It kind of sounds bad, but I kind of laugh at times because it's like, if you were just nicer, you know what I mean?\n\"I didn't do anything to deserve that, but you felt the need to do that, and look at life now.\"\nThat's what drives him to be so active in anti-bullying campaigns in conjunction with the Jets. He'll go to a school and sit at lunch with a child who has experienced bullying, trading stories and bonding.\n\"My whole message is: You will be all right and you will come out on the other end stronger, as long as you allow yourself to,\" he said. \"If you allow whatever's influencing you to get to you and get under your skin, yeah, it's going to cripple you. It's going to cripple you emotionally, cripple you mentally and psychologically.\n\"But if you take that and you just keep, not fighting back but keep standing up to whatever that influence may be, you'll realize over time that it makes you stronger on the inside and it gives you the confidence necessary to go through life.\"\n———\nMore AP NFL:  and  ", "title": "Jets' Harrison overcame years of bullying to achieve dreams", "author": "dennis waszak jr., ap pro football writer", "date": "FLORHAM PARK, N.J. \u0097 Dec 1, 2018, 2:54 AM ET"},
{"url": "https://abcnews.go.com/Sports/pro-bowl-running-back-kareem-hunt-cut-team/story?id=59536284", "body": "\nKansas City Chiefs star running back Kareem Hunt was released from team late Friday night after a video emerged showing what appears to be the star running back striking a woman.\n\n“Earlier this year, we were made aware of an incident involving running back Kareem Hunt,\" team officials said in a statement. \"At that time, the  and law enforcement initiated investigations into the issue.\"\n\n\"As part of our internal discussions with Kareem, several members of our management team spoke directly to him,\" the statement continued. \"Kareem was not truthful in those discussions. The video released today confirms that fact. We are releasing Kareem immediately.”\n\nHunt released a brief statement to ESPN, saying, \"I want to apologize for my actions. I deeply regret what I did. I hope to move on from this.\"\n\n\n\n\n\nAlleged victim Abigail Ottinger told Cleveland police on Feb. 10 she was “assaulted by a player and the man working at the desk refused to let her call the police and called her a slut,” according to police records obtained by ABC News.\n\nStatement from the Kansas City Chiefs on Kareem Hunt\n\n??  \n\nIt could not immediately be determined what if any actions authorities took in response to Ottinger's accusations.\n\nHunt was not arrested or charged by Cleveland police.\n\n\n\nCleveland Police officials said they did not release the surveillance video. TMZ  the story and posted the video.\n\n\n\n\nIn a statement to ABC News, a hotel spokesperson for Cleveland's The Metropolitan at the 9 hotel, issued a statement to ABC News confirming an incident did occur involving the running back. They added that it was an ongoing investigation and that they are cooperating.\n\n\n\n\n\nThe 23-year-old, who led the league in rushing last year, was placed on the Commissioner Exempt list earlier in the day. The NFL said it, nor the Chiefs, had seen the video until Friday despite requesting it from police and the hotel for months.\n\n\"The NFL has placed Kareem Hunt of the Kansas City Chiefs on the Commissioner Exempt list, and as a result, he may not practice, play or attend games,\" NFL officials said in a statement.\n\n\n\n\n\"The NFL's investigation, which began immediately following the incident in February, will include a review of the new information that was made public today,\" the statement added.\n\n, another NFL player accused of domestic assault earlier this month was also placed on the Commissioner Exempt list.\n\nFoster was picked up by the Washington Redskins, but is still not off that list.", "title": "Pro Bowl running back Kareem Hunt cut from Kansas City Chiefs after video surfaces of alleged assault against a woman", "author": "Luke Barr", "date": "Nov 30, 2018, 11:26 PM ET"},
{"url": "https://abcnews.go.com/Sports/tracking-college-footballs-coaching/story?id=59510033", "body": "\n\nIt may not be as wild as last year, but the coaching carousel has begun. Take a look at the FBS schools that have decided to change head coaches:\n  ", "title": "Tracking college football's coaching changes", "author": "ESPN", "date": "Nov 29, 2018, 9:46 PM ET"}
]