[
{"url": "https://www.foxnews.com/sports/kansas-city-chiefs-release-kareem-hunt-after-video-shows-him-pushing-kicking-a-woman", "body": "\n          Running back Kareem Hunt, No. 27 with the Kansas City Chiefs, runs to the sidelines just before kickoff in the game against the Miami Dolphins at Arrowhead Stadium on Dec. 24, 2017, in Kansas City, Missouri (Photo by Jason Hanna/Getty Images).\n          The NFL's Kansas City Chiefs have released running back Kareem Hunt after a video surfaced Friday showing the star player pushing and kicking a woman during an altercation in an Ohio hotel back in February.The video, first obtained by , shows Hunt arguing with the 19-year-old woman at the Metropolitan in Cleveland about 3:22 a.m.on Feb. 10.Hunt approaches the woman as he says something, before he's seen shoving her. An unidentified male steps in, and the woman proceeds to hit Hunt in the face.More of the NFL player’s friends step in as he becomes more enraged. He shoves another male into the woman, who then falls down and appears to grab her head. As she is crouched on the floor, the footage shows, Hunt comes over and kicks her.In a statement, the team said it was releasing Hunt after finding that he had not been “truthful” during the NFL’s investigation: “Earlier this year, we were made aware of an incident involving running back Kareem Hunt. At that time, the National Football League and law enforcement initiated investigations into the issue. As part of our internal discussions with Kareem, several members of our management team spoke directly to him. Kareem was not truthful in those discussions. The video released today confirms that fact. We are releasing Kareem immediately.”Hunt was excused from practice at the facility initially when the video was released. The NFL later announced that he had been placed on the Reserve/Commissioner Exempt List, which meant “he may not practice, play or attend games.”\"The NFL's investigation, which began immediately following the incident in February, will include a review of the new information that was made public today,” the league said in its own statement.According to reports, neither the NFL nor the Chiefs had seen the video before Friday; the hotel would only cooperate with law enforcement and police would not release the tape.Police made no arrests initially because officers say they were unable to determine if a crime had been committed, TMZ reported, citing police reports.The woman, reportedly a student at Kent State, told authorities at the time that the argument began when she refused to hook up with one of Hunt’s friends, t.But a female friend of Hunt’s claimed that the woman was acting belligerently and struck her.Chiefs owner Clark Hunt said in August that he believed the running back “learned some lessons” prior to this season's start.\"Kareem is a young man, second year in the league, obviously had a very big year on the field last year,\" he said in speaking of the February incident. \"I'm sure he learned some lessons this off-season and hopefully won't be in those kind of situations in the future.\"Hunt led the league last year as a rookie with 1,327 yards and eight touchdowns.", "title": "Running back Kareem Hunt, No. 27 with the Kansas City Chiefs, runs to the sidelines just before kickoff in the game against the Miami Dolphins at Arrowhead Stadium on Dec. 24, 2017, in Kansas City, Missouri (Photo by Jason Hanna/Getty Images).", "author": "Paulina Dedaj | Fox News", "date": "1 day ago"},
{"url": "https://www.foxnews.com/sports/former-patriots-tight-end-aaron-hernandez-blasted-coach-bill-belichick-for-lack-of-support", "body": "\n          Aaron Hernandez, right, slammed Bill Belichick while he was in jail on a murder charge.\n          Late New England Patriots tight end Aaron Hernandez -- who was convicted of murder before the verdict was tossed by a judge after Hernandez's suicide -- expressed disgust with coach Bill Belichick in a phone call with a former teammate while he was in jail.Hernandez’s talk with former Patriots teammate Brandon Spikes was one of about 900 phone conversations released by the Bristol County sheriff this week, the  reported Friday. Hernandez didn’t appear happy Belichick didn’t support him -- the team released him -- after he was arrested and accused of murder.“Bill Belichick is the number one person who teaches his team, don’t listen to the media because most of the time they make up stories and they’re rarely true,” he told Spikes. “I wish he practiced what he preached, especially coming to me, throwing me in the dust with the wind.”Hernandez committed suicide in April 2017 while serving a life sentence for the 2013 murder of Odin Lloyd. Belichick was issued a subpoena to testify in Hernandez’ subsequent double-murder trial, but never showed up in court,  reported. The trial ended up moving on without him.While Belichick issued a statement soon after Hernandez’s release from the team, another teammate told the  he was there when the coach addressed the team separately.“He is not part of this team,” Hernandez’s former teammate recalled Belichick saying at the time. “He will not be spoken about in this locker room.”Even after his arrest on the murder charge, though, Hernandez was telling teammates he planned on playing in the league again.“I’m still going to be young when I get out of jail, so you know I’m going to try to play ball again,” he told his former college teammate, and Los Angeles Chargers center, Mike Pouncey.In the calls, he angrily responds to rumors of being gay and denied using angel dust. Terri Hernandez, Aaron’s mother, also told the Boston Globe her son directed a lot of his anger toward her.", "title": "Aaron Hernandez, right, slammed Bill Belichick while he was in jail on a murder charge.", "author": "Ryan Gaydos | Fox News", "date": "1 day ago"},
{"url": "https://www.foxnews.com/sports/patrick-corbins-family-tries-to-influence-free-agent-pitcher-to-sign-with-star-studded-team", "body": "\n          Patrick Corbin is one of this year's hottest free-agent pitchers.\n          Free-agent pitcher Patrick Corbin may not have made a decision about which team he's going to sign with during the offseason -- but his family on Thursday hoped to be a guiding influence.Someone who attended Corbin’s recent wedding told  the pitcher’s younger brother made an effort to nudge the lefthander towards signing with the New York Yankees, who are known to be one of Corbin's suitors.“His younger brother gave a best-man speech and at the end took out a Yankees hat and put it on, which elicited a great applause, and said they all hoped that he and [his wife] would be moving closer to home,” the unidentified attendee told The Athletic.Corbin, who was born in Clay, N.Y. – located 265 miles north of Yankee Stadium in the Bronx – has reportedly received interest from the Yankees, Philadelphia Phillies and Washington Nationals so far. He may command a seven-year deal worth up to $175 million, according to a .The 29-year-old former Arizona Diamondbacks star was 11-7 with a 3.15 ERA, 11.1 K/9 and 6.3 fWAR.", "title": "Patrick Corbin is one of this year's hottest free-agent pitchers.", "author": "Ryan Gaydos | Fox News", "date": "1 day ago"},
{"url": "https://www.foxnews.com/sports/nba-star-stephen-curry-helps-rectify-girls-issue-with-signature-sneaker", "body": "\n          Golden State Warriors guard Stephen Curry warms up before the team's NBA basketball game against the Portland Trail Blazers in Oakland, Calif., Friday, Nov. 23, 2018.\n          Golden State Warriors star Stephen Curry helped rectify an issue that a “disappointed” 9-year-old girl had when she was shopping for the guard’s signature Under Armour sneaker.The girl, whose name is Riley, wrote a letter to Curry on Nov. 18, detailing an issue she had when trying to buy the Curry 5’s before the start of her basketball season. The letter was shared on her father’s .“My dad and I visited the Under Armour website and were disappointed to see that there were no Curry 5’s for sale under the girls section,” the letter read. “However, they did have them for sale under the boy’s section, even to customize. I know you support girl athletes because you have two daughters and you host an all girls basketball camp. I hope you can work with Under Armour to change this because girls want to rock the Curry 5’s too.”Riley, a Napa, Calif. native, also told  she wrote the letter not just to get to wear the sneakers, but to give girls the same chances that boys get.After her letter went viral on social media, Curry responded Thursday with a note of his own.“Unfortunately, we have labeled smaller sizes as ‘boys’ on the website,” Curry . “We are correcting this NOW! I want to make sure you can wear my kicks proudly — so I am going to send you a pair of Curry 5’s now AND you’ll be one of the first kids to get the Curry 6.”Curry added that Under Armour had a special plan for International Women’s Day on March 8 and invited Riley to celebrate with him in Oakland. The Warriors take on the Denver Nuggets that night.", "title": "Golden State Warriors guard Stephen Curry warms up before the team's NBA basketball game against the Portland Trail Blazers in Oakland, Calif., Friday, Nov. 23, 2018.", "author": "Ryan Gaydos | Fox News", "date": "1 day ago"},
{"url": "https://www.foxnews.com/sports/former-nfl-player-uses-lowest-point-of-his-life-to-propel-him-toward-incredible-feat", "body": "\n          Mark Pattison's seven summits climb includes Mount Kilimanjaro in Africa.\n          A former NFL player used one of the lowest points of his life to propel him forward into doing something no other football player has ever done – climb the Seven Summits.Mark Pattison, 56, played three seasons in the NFL with the Los Angeles Raiders, Los Angeles Rams and New Orleans Saints, but football didn’t appear to be in his DNA. According to , Pattison went on to found a gaming company, a digital media company and a retail company.It wasn’t until 2011 when things started to get tough for Pattison.In that year, he and his wife of 24 years split up. Soon after, his father passed away from a stroke. Pattison said it was years before he was able to turn it around and turned to nature to help him.“My mind was always like, ‘How did I get here?” Pattison said. “Finally after a couple of years, I was just like … I’m stuck. And you can’t move forward to do anything unless you get unstuck.”Pattison then embarked on a journey to become the first player to climb the Seven Ssummits. They include Mount Kilimanjaro in Africa; Mount Elbus in Europe; Mount Kosciusko in Australia; Aconcagua in South America; Denali (formerly Mount McKinley) in North America; Mount Vinson in Antartica; and Mount Everest in Asia.“It’s not about the summit, it’s about the journey,” Pattison said.Since 2013, he’s completed five of the seven summits. He plans on completing the final summit, Everest, in 2020, according to the outlet.", "title": "Mark Pattison's seven summits climb includes Mount Kilimanjaro in Africa.", "author": "Ryan Gaydos | Fox News", "date": "1 day ago"},
{"url": "https://www.foxnews.com/sports/john-cena-to-be-honored-with-muhammad-ali-legacy-award", "body": "\n          Sports Illustrated announced Thursday that it would bestow WWE star John Cena next month with the Muhammad Ali Legacy Award in recognition of his work in philanthropy.\n          Sports Illustrated announced Thursday that it would bestow WWE star John Cena with the Muhammad Ali Legacy Award next month in recognition of his philanthropy work.While noting Cena’s success as a 16-time WWE champion,  his efforts with the Make-A-Wish Foundation, where he “has granted nearly 600 wishes for children with life-threatening illnesses, more than anyone else involved with the organization,” Sports Illustrated said.They also acknowledged him as a supporter of breast cancer awareness and early detection.Following the announcement, Cena took to saying this was “something I never dreamed could be possible.”“Thank you for this honor, I’ll do best to live up to its reputation,” he continued.He also told Sports Illustrated that he was “truly thrilled” to be getting the award.“Ali's commitment to helping others, his dedication to the sport and his generous spirit are incomparable and he was a role model to us all,” the wrestling star said. “To be linked with him in any way is an honor that means so much to me.”The honor, which was established in 2008 and renamed to honor Ali in 2015, is given each year to an athlete or sports figure who embodies the ideals of sportsmanship, leadership and philanthropy while using sports as a platform, according to The Associated Press.Past recipients of the award, which is scheduled to be given to Cena at the Sportsperson of the Year ceremony on Dec. 11 in Los Angeles, include Kareem Abdul-Jabbar, Jack Nicklaus and Colin Kaepernick, Sports Illustrated said.", "title": "Sports Illustrated announced Thursday that it would bestow WWE star John Cena next month with the Muhammad Ali Legacy Award in recognition of his work in philanthropy.", "author": "Elizabeth Zwirz | Fox News", "date": "1 day ago"},
{"url": "https://www.foxnews.com/sports/purdue-football-coachs-high-school-alma-mater-receives-threat-after-his-decision-to-stay-at-school", "body": "\n          In this Nov. 24, 2018, file photo, Purdue coach Jeff Brohm watches his team play Indiana during an NCAA college football game in Bloomington, Ind.\n          A Kentucky high school, where Purdue football coach Jeff Brohm had attended, canceled classes Thursday after a threat was made against the school over Brohm’s decision to stay at his job instead of leaving for Louisville.Brohm, 47, a Louisville native, attended Trinity High School. Brohm’s brothers and their father also attended the high school, according to . Brohm’s father is still an assistant football coach at the high school. It wasn’t clear when the threat was made.Brohm on Wednesday informed Purdue athletic director Mike Bobinski he was turning down the Louisville job to stay with the Boilermakers. He had met with Louisville officials one day earlier.“After intense and thorough discussion, I believe it is important to finish the building process we have begun and honor the commitment I made to our football program, players and recruits,” Brohm said in a statement. “While going home was very appealing and meaningful to me, the timing was not ideal. I believe that remaining at Purdue is the right thing to do, and I am excited for the challenges ahead.”Trinity High School – a Catholic all-boys school – said in a statement Wednesday night the school was notified of the threat by St. Matthews police.\"Trinity officials were notified by police of a threat against the school due to Jeff Brohm deciding to remain at Purdue,\" the .Police Chief Barry Wilkerson told ESPN his department and the FBI were investigating the threat.“We take these threats seriously, especially towards a school,” Wilkerson said. “We're going to investigate as much as we can at this point. It's difficult when you have Twitter accounts to trace back, so it's a little more complex than pushing a button and figuring out who it is. We'll investigate it fully and bring charges, if necessary.”Wilkerson added that whoever made the threat could face charges even if it was a hoax.Brohm is 13-12 with Purdue. He previously coached Western Kentucky where he went 30-10 in three seasons.", "title": "In this Nov. 24, 2018, file photo, Purdue coach Jeff Brohm watches his team play Indiana during an NCAA college football game in Bloomington, Ind.", "author": "Ryan Gaydos | Fox News", "date": "2 days ago"},
{"url": "https://www.foxnews.com/sports/nfl-network-reporter-kimberly-jones-leaves-hospital-after-health-scare-the-surgeons-saved-my-life", "body": "\n          NFL Network's Kimberly Jones leaves the hospital after suffering a health scare.\n          NFL Network reporter Kimberly Jones left a Virginia hospital’s vascular unit and thanked doctors for saving her life after being hospitalized for two weeks.Jones was staying at the Inova Fairfax Heart & Vascular, but it wasn’t clear what she was in the hospital for.“The surgeons saved my life, against big odds. The nurses have been great, the techs have been great — everyone in this hospital has helped put me back together,” she said in an .Jones, 49, also thanked the NFL Network for their support and she hoped to return in front of the cameras soon.She didn’t give any details about what plagued her, but posted a  on Thanksgiving saying she “almost died.”“A week ago today, I almost died,” Jones said. “Great doctors saved my life — but that’s for another day.”Jones has worked for the NFL Network since 2012. Previously, she spent time as a New York Giants and New York Yankees beat reporter and the occasional fill-in host on WFAN in New York City.", "title": "NFL Network's Kimberly Jones leaves the hospital after suffering a health scare.", "author": "Ryan Gaydos | Fox News", "date": "2 days ago"},
{"url": "https://www.foxnews.com/sports/kent-state-basketball-recruit-becomes-first-player-with-autism-to-join-division-1-school", "body": "\n          A college basketball recruit is making history.\n          A men’s college basketball recruit made history earlier this month when he became the first player with autism to sign a letter of intent with a Division 1 school.Kailin Bennett, a 6-foot-10 center, will leave Little Rock, Arkansas, to join Kent State in the school’s 2019-20 freshmen class.The Golden Flash announced Bennett had signed the letter of intent Nov. 14. He was ranked as the No. 16 prospect in Arkansas and is coming from the Little Rock Christian Academy.“We knew we were going to recruit some size and watched Kalin play this summer and got to know him and his story,” Kent State head coach Rob Senderoff said in a . “We are really excited to bring him to Kent State. He has autism and to my knowledge, he will be the first Division I player with autism to sign an NLI. We're very excited about the potential he has as a basketball player and he's only scratching the surface. Kalin is a big, strong, physical player that has a soft touch. We look forward to watching his development over the next few years”Bennett told  on Sunday he hopes to inspire kids who battle with autism to achieve their goals.“I want to make an impact not just on the court, but with kids that are struggling with the same things I am,” he said. “I want to use this platform to inspire other kids with autism and non-autism. I want to let them know, hey, if I can do this, you can do it, too. A lot of times they feel alone and by themselves, and I felt that same way growing up.”Bennett said he chose Kent State because of the school’s services that .“Going there and seeing that [support] opened some doors I haven’t really thought about in a while,” he told Cleveland.com of a recruiting trip in September.Bennett, who also excels in music and math, will join the Golden Flash next summer.", "title": "A college basketball recruit is making history.", "author": "Ryan Gaydos | Fox News", "date": "3 days ago"},
{"url": "https://www.foxnews.com/sports/european-soccer-fans-left-bloodied-after-violent-rivals-throw-petrol-bombs-and-flares-into-the-stands", "body": "\n          Riot police were called into action to diffuse the situation after home supporters threw a petrol bomb and flares into the stands of the Athens stadium where the traveling Ajax fans were.<br data-cke-eol=\"1\">\n          Chaos unfolded in the stands prior to AEK Athens' Champions League defeat to Ajax in Greece.Riot police were called into action to diffuse the situation after home supporters threw a petrol bomb and flares into the stands where the traveling Ajax fans were.But shocking photos show the officers whacking the Dutch supporters with batons, leaving individuals with gruesome cuts.\n      Shocking photos show the officers whacking the Dutch supporters with batons, leaving individuals with gruesome cuts.<br data-cke-eol=\"1\">\n      One picture shows an Ajax fan reacting towards a police officer as he sports a bloodied face as a result of the violence, while another shows an AEK Athens throwing a flare into the crowd as riot police simply look on.Reports claim 11 fans were injured in the shocking incident.Reports have suggested that Panathinaikos fans were amongst the traveling supporters, with the Greens and AEK sharing a fierce rivalry.", "title": "Riot police were called into action to diffuse the situation after home supporters threw a petrol bomb and flares into the stands of the Athens stadium where the traveling Ajax fans were.<br data-cke-eol=\"1\">\n          \n      Shocking photos show the officers whacking the Dutch supporters with batons, leaving individuals with gruesome cuts.<br data-cke-eol=\"1\">", "author": "", "date": "3 days ago"},
{"url": "https://www.foxnews.com/sports/irish-soccer-club-apologizes-after-falsely-reporting-players-death", "body": "\n          An Irish soccer team was forced to apologize for falsely reporting a player's death.\n          An Irish soccer club was forced to apologize Tuesday after falsely stating one of its players had died.Ballybrack FC told Leinster Senior League officials that Fernando Nuno La-Fuente had been killed in a motorcycle accident, forcing postponement of its match against Arklow Town FC, according to the . Players across the league also wore armbands in remembrance of La-Fuente, according to .The league investigated La-Fuente’s death and discovered some of his teammates were posting on social media that he had gone back to Spain, according to the Guardian.“We rang and we couldn’t get any answers out of them,” Leinster Senior League chairman David Moran told the . “We checked the hospitals, everywhere. Nobody could find anything about this young fella. Some of his teammates [then] released stuff on social media, saying he went back to Spain four weeks ago.”The league condemned Ballybrack FC after it was confirmed La-Fuente did in fact return to Spain.“THE Leinster Senior League would like to acknowledge that the notification of the death of a Ballybrack FC player as shared with all member clubs and media partner is, without foundation,” Moran said in a statement Tuesday, adding that the player was in “good health” and returned to Spain.Ballybrack FC called the incident a “gross error of judgment.”“As of this evening an emergency meeting was held and the person in question has been relieved of all footballing duties, within Ballybrack FC, its senior team and roles within the club itself. The club has contacted Fernando to confirm his whereabouts, wellbeing and are thankful for his acceptance of our apology on this matter,” .“This grave and unacceptable mistake was completely out of character and was made by a person who has been experiencing severe personal difficulties unbeknownst to any other members of the club. The club will continue to provide a duty of care to all parties and offer the support that may be needed at this time. This person had previously contributed greatly to the senior team within the club in recent years and to the wider footballing community across Dublin for decades.”Moran told the Irish newspaper he will meet with the club Thursday to discuss a punishment.", "title": "An Irish soccer team was forced to apologize for falsely reporting a player's death.", "author": "Ryan Gaydos | Fox News", "date": "3 days ago"},
{"url": "https://www.foxnews.com/sports/loyola-chicago-honors-sister-jean-with-her-own-final-four-ring", "body": "\n          Loyola University of Chicago's Sister Jean shows off the NCAA Final Four ring she received before an NCAA college basketball game between Loyola of Chicago and Nevada in Chicago, Tuesday, Nov. 27, 2018.\n          Loyola-Chicago men’s basketball team rallied around Sister Jean throughout March Madness last season, all the way to the Final Four, and on Tuesday night the school honored their chaplain with a ring commemorating the team's miracle run.Sister Jean, 99, was welcomed into the Gentile Arena before the Ramblers took on Nevada in a rematch of their Sweet 16 meeting, which saw Loyola come away with a one-point victory.Loyola fans started to chant “You deserve it!” while Sister Jean, who was born Jean Dolores Schmidt, showed off her new piece of jewelry to the crowd, according to .The nun had already been at a Ramblers game this season, helping the team raise its Final Four banner on Nov. 6. She told  at the time she still had high hopes for her squad.“They still have that same team spirit,” she said. “The fellas who were here last year have transmitted that to the new ones.”However, on Tuesday, the Ramblers dropped to 4-3, losing to Nevada 79-65.During last season's NCAA tournament, No. 11 seeded Loyola Chicago lost to No. 3 seeded Michigan in one of the national semifinals played at San Antonio. Villanova then topped Michigan in the final.", "title": "Loyola University of Chicago's Sister Jean shows off the NCAA Final Four ring she received before an NCAA college basketball game between Loyola of Chicago and Nevada in Chicago, Tuesday, Nov. 27, 2018.", "author": "Ryan Gaydos | Fox News", "date": "3 days ago"}
]