[
{"url": "https://profootballtalk.nbcsports.com/2018/12/01/colts-already-strong-offensive-line-gets-joe-haeg-back/", "body": "The Colts’ offensive line has been excellent this season, and it should get better now.That’s because Joe Haeg, an offensive tackle who started the first three games of the season, has been activated from injured reserve.Haeg, who started 15 games last year and 14 games the year before, was a fifth-round draft pick in 2016. He was injured in Week Three and has been on injured reserve since. The Colts haven’t much missed Haeg since he was hurt, and he might not get his starting job back, but it can’t hurt to have some veteran depth with starting experience. Haeg has started on both the right and left side, and at both tackle and guard.To make room for Haeg on the 53-man roster, the Colts waived tackle/guard Denzelle Good. The team also signed quarterback Phillip Walker to the practice squad and released defensive end Anthony Winbush from the practice squad.", "title": "Colts’ already strong offensive line gets Joe Haeg back", "author": "Posted by Michael David Smith", "date": "December 1, 2018, 12:54 PM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/12/01/josh-adams-pops-on-on-eagles-injury-report/", "body": "The final injury report of the week contains a surprise.Eagles running back Josh Adams is questionable for Monday night’s game against Washington, with a hip injury. Adams was limited in practice on Saturday. He didn’t appear on the injury report at all on Thursday or Friday.Also questionable for the game are defensive end Michael Bennett (foot) and running back Darren Sproles (hamstring). Sproles is expected to play for the first time since Week One.Linebacker Jordan Hicks (calf), cornerback Avonte Maddox (ankle, knee), and cornerback Jalen Mills (foot). Cornerback Sidney Jones (hamstring) has no designation on the Saturday report, which means he’ll play.", "title": "Josh Adams pops on on Eagles injury report", "author": "Posted by Mike Florio", "date": "December 1, 2018, 4:23 PM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/12/01/colin-kaepernick-supporters-plan-to-rock-the-probowlvote/", "body": "Colin Kaepernick hasn’t played in an NFL game in two years. Could he make his return this season, in the Pro Bowl?That’s what some of his supporters plan to find out. This year the NFL is allowing fans to vote for Pro Bowlers on Twitter by using the hashtag #ProBowlVote and writing the name of the player they want to vote for. That means players don’t have to be on any official ballot to receive a Pro Bowl vote. They simply have to have their names tweeted. And Kaepernick has plenty of supporters on Twitter who have begun voting for him.Will the NFL count those votes? It seems doubtful. The league will probably say that only active players can be voted into the Pro Bowl. But there’s precedent in other sports for players who weren’t actually actively playing to appear in an all-star game. Most notably, Magic Johnson, who retired from the NBA before the 1991-92 season, was still voted into the all-star game by the fans, played in it and won the game’s MVP award.And perhaps the league, feeling pressured by Kaepernick’s collusion lawsuit, would decide to extend the invitation to Kaepernick, if he wins the fan vote. It would certainly make the Pro Bowl a lot more interesting than usual.", "title": "Colin Kaepernick supporters plan to rock the #ProBowlVote", "author": "Posted by Michael David Smith", "date": "December 1, 2018, 3:17 PM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/12/01/will-someone-claim-kareem-hunt-on-waivers/", "body": "Chiefs running back Kareem Hunt will soon be former Chiefs running back Kareem Hunt. And he will be exposed to waivers. And so the next question becomes whether anyone will claim him on waivers.On Tuesday, Washington surprisingly claimed former 49ers linebacker Reuben Foster on waivers. Destined for the Commissioner Exempt list, Washington chose to pay Foster $257,000 over the balance of the season in order to secure dibs on future services in 2019.But for the Foster kerfuffle, there’s a chance one or more teams would have pounced on Hunt. The reaction to the acquisition of Foster could keep all teams from paying Hunt $33,000 per week to not play in order to have the rights to the balance of his rookie contract when he’s cleared to play.Surely, he’ll eventually be cleared to play. While Hunt’s misconduct merits punishment, it doesn’t merit banishment. (Then again, Colin Kaepernick’s conduct, which wasn’t even misconduct, resulted in banishment.) At some point, the league will impose punishment on Hunt, Hunt will serve an unpaid suspension, and Hunt then will be able to play.This isn’t an over-the-hill Ray Rice, whose best football days were behind him. This is a guy who led the league in rushing as a rookie. He’ll get his second chance somewhere, just not in Kansas City.Potential candidates include, as mentioned last night, the Eagles. Also, the Browns currently are run by the guy who drafted Hunt in Kansas City. And what if Chiefs offensive coordinator Eric Bieniemy ends up coaching his own team (which could be Cleveland)?Plus, Washington can never be ruled out, because Washington already has proven that talent continues to trump whether and to what extent a player has gotten in trouble. And Hunt clearly has talent. If that didn’t matter, guys like Tyreek Hill and Joe Mixon wouldn’t currently be employed by NFL teams.", "title": "Will someone claim Kareem Hunt on waivers?", "author": "Posted by Mike Florio", "date": "December 1, 2018, 2:00 PM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/12/01/cowboys-address-mystery-man-on-saints-sideline/", "body": "In the aftermath of a Saints-Cowboys game during which the home team stymied one of the most potent offensive in football, suspicions have emerged in connection with images showing a person in Cowboys gear with a headset (and apparently a cell phone) on the New Orleans sideline. And, yes, the Saints are suspicious.The Cowboys have explained the issue in this way: “It’s a member of the game day entertainment staff.  He stands next to the ‘green hat’ who is the network TV person who works with the officials to coordinate TV timeouts.  His job is to communicate to our internal video board people when a TV time out is coming and how much time is left in that timeout as they come out of a break.  He does not stand in the team bench area.  They stand just outside the bench area on that side of the field.”The image that was tweeted shows the person close to Saints coach Sean Payton, but that doesn’t necessarily mean that the person was in the bench area. The Cowboys insist that the employee would never enter the bench area, toward the middle of the sideline.Whether the Cowboys’ explanation satisfies the Saints’ suspicions remains to be seen. If the Cowboys were going to be engaged in any type of spy operation, it definitely would be unusual for the guy to be wearing a polo shirt bearing the Cowboys logo.The NFL has not responded to a request for comment regarding the situation.A similar incident occurred in 2015, when the Jets instigated a sideline interrogation of Kraft Sports employees during a game against the Patriots. Those employees were also responsible for in-stadium entertainment, and one was responsible for providing batteries to the referee’s wireless microphone.The easiest way to avoid these situations would be to require the employees of a given team to do whatever they have to do from the sideline of the team they work for. That would completely eliminate any possible allegations of shenanigans.", "title": "Cowboys address mystery man on Saints sideline", "author": "Posted by Mike Florio", "date": "December 1, 2018, 12:54 PM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/12/01/nfl-may-have-overcorrected-post-ezekiel-elliott/", "body": "The Ray Rice fiasco, which nearly brought sweeping and dramatic change to the league office, sparked the NFL to respond in a way that would avoid future P.R. debacles. And then, in the opinion of at least one influential owner, the NFL went too far the other way, creating problems when there officially otherwise were none.Less than two years after Ray Rice, the NFL launched an aggressive investigation regarding allegations of domestic violence against Cowboys running back Ezekiel Elliott. The league eventually imposed a six-game suspension on Elliott, even though he was never criminally charged or civilly sued. The procedures, which included a half-dozen private interviews of the alleged victim, included no opportunity for Elliott to confront or question the accuser, and featured at least one league investigator who believed that Elliott should not be suspended.The situation greatly angered Cowboys owner Jerry Jones, and it fueled a persistent, creative, and stunning effort by Jones in 2017 to block the Commissioner’s contract extension, with the ultimate goal of securing a new Commissioner.And so, in the immediate aftermath of the Commissioner getting his extension, it appears that the league may have softened its stern, unforgiving approach to off-field misconduct, an approach that ignored all efforts of law enforcement and drilled down on the facts and circumstances with the goal of reaching a conclusion as to whether the player did what he was accused of doing, under a much lower standard of proof than beyond a reasonable doubt. How else can anyone explain the fact that soon-to-be-former Chiefs running back Kareem Hunt: (1) was accused of shoving a woman in February 2018; (2) nothing seemed to happen over an extended period of time, even though the alleged victim clearly was motivated to receive some sort of justice or satisfaction; and (3) nearly 10 months later, a video of the incident suddenly emerges and Hunt is immediately suspended with pay by the league and then fired without pay by his team?The league says it never saw the video before TMZ published it. Privately, the contention is that multiple attempts were made to obtain the video, that the hotel refused to provide the video to the NFL, and that the Cleveland Police Department likewise didn’t provide the video. (Others are reporting these contentions as facts. They aren’t facts; they are contentions that may or may not ultimately be supported by facts.)Whatever the contentions or private explanations, here’s the reality: If the league learned anything from the Ray Rice case, it learned that it must do anything and everything to track down any and all available video of any alleged incident involving a player, because it always must be assumed that the video eventually will be obtained by TMZ. And if the league opted not to do that in Hunt’s case, the only explanation (other than gross incompetence) is that the NFL has decided to search for a middle ground between Rice and Elliott, one that entails swift and decisive action when required along with a commitment to focusing only on football unless and until the hand of the Shield is forced.If that’s the compromise, it may not be the right one. Because it may not be enough to suddenly say, “Oh, there’s video? We tried to get the video but no one would give us the video. Well, now that there’s video, that changes everything.”As a multi-billion-dollar operation that is far bigger and more powerful than TMZ, it’s fairly presumed that the league has the ability to get anything that TMZ is able to get. And if the NFL doesn’t have the current internal expertise to get videos that TMZ seems to always obtain, maybe the NFL needs to hire someone from TMZ to help the NFL figure out how to get those videos.That’s the biggest flaw in the balance the NFL currently seems to be trying to strike. Given the power of video, the league should always be relentless when it comes to tracking down any and all video of any player incident, since it always should be assumed that the video will inevitably emerge.", "title": "NFL may have overcorrected, post-Ezekiel Elliott", "author": "Posted by Mike Florio", "date": "December 1, 2018, 10:36 AM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/12/01/nfl-fines-shaq-lawson-33425-for-fight-with-leonard-fournette/", "body": "The NFL suspended Jaguars running back Leonard Fournette for his fight last week with Bills linebacker Shaq Lawson. And although Fournette was the only one suspended, Lawson didn’t get off scot-free.The NFL has fined Lawson $33,425 for his part in the fracas. That’s a stiff fine, although it’s less than a suspension would have cost him: Suspensions are unpaid, and Lawson makes $81,438 a week, so that’s how much Lawson would have lost if he had been suspended for one game.Why was Fournette suspended and Lawson merely fined? Fournette was not involved in the play before the skirmish between the teams started. He ran from the sideline, across the field and into the fight. That was viewed as worse than Lawson, who was in the middle of the fight but didn’t seek it out.Still, Lawson has to consider himself fortunate: He got into a fight, and he appeared to want to continue the fight after both he and Fournette were ejected and were heading toward their respective locker rooms. He was lucky to get off with a fine, even a hefty fine.", "title": "NFL fines Shaq Lawson $33,425 for fight with Leonard Fournette", "author": "Posted by Michael David Smith", "date": "December 1, 2018, 5:18 PM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/12/01/bears-downgrades-dont-include-trubisky/", "body": "There’s still a chance Mitchell Trubisky will play on Sunday.The Bears downgraded two of their three doubtful players to out on Saturday, explaining that the players won’t be traveling to New York. Of the three, Trubisky was the only one who wasn’t listed.Running back Benny Cunningham and defensive back Sherrick McManis, who were both doubtful with ankle and hamstring injuries respectively, have been downgraded.Trubisky has a shoulder injury. Chase Daniel reportedly will start at quarterback.Still, Trubisky has a chance to play, given that he will be actually present at MetLife Stadium.", "title": "Bears downgrades don’t include Trubisky", "author": "Posted by Mike Florio", "date": "December 1, 2018, 4:30 PM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/12/01/dolphins-extend-nick-oleary-through-2019/", "body": "Nick O'Leary will stick around in Miami for another season.O’Leary, a tight end who signed a one-year contract with the Dolphins this year, has signed an extension through 2019, his agents announced on Twitter.The 26-year-old O’Leary, who I’m obligated by the Sportswriters Code to mention is the grandson of Jack Nicklaus, was a sixth-round draft pick of the Bills in 2015.After the Bills cut O’Leary at the end of the preseason this year, the Dolphins signed him first to the practice squad and then to the active roster. He has played fairly well as Miami’s third tight end and now has some security heading into next year.", "title": "Dolphins extend Nick O’Leary through 2019", "author": "Posted by Michael David Smith", "date": "December 1, 2018, 12:27 PM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/12/01/packers-ceo-im-not-ready-to-give-up-on-the-season/", "body": "As the Packers face a low-probability run-the-table-and-get-plenty-of-help scenario to make it to the playoffs, the man in charge of the franchise isn’t ready to fold the tents.“I’ve heard from a lot of fans this week regarding the state of the team,” Packers CEO Mark Murphy writes in the preamble to an online Q&A. “Many have said that, since the chances of making the playoffs are so slim, we should sit some of our starters (including Aaron Rodgers), play more of our younger players and focus on the future. Others have said that we shouldn’t worry about winning and that a benefit would be that we would have a better draft position.”It’s a bit of a surprise that Murphy would proactively address the issue of tanking. Yes, the temptation to tank is real, and from a business standpoint it makes plenty of sense to put lesser players on the field under the guise of evaluating them, but with a broader goal of losing now and winning in April via higher slots in each of the seven rounds of the draft. But the NFL and its teams typically avoid affirmatively discussing (and in turn legitimizing) what amounts to a direct threat to the integrity of late-season games between teams that have something on the line and teams that don’t.“I’m not ready to give up on the season,” Murphy adds, as if he or anyone else would admit to giving in to the tanking temptation. “Now, I realize that we are 4-6-1 (and as Bill Parcells famously said, ‘You are what your record says you are’) and that we haven’t played well. However, we still have almost a third of the season left to play. I know that the odds of making the playoffs are slim (I’ve seen odds range from 3 to 15 percent), but we still have a lot to play for. If we can finish the season strong, even if we don’t make the playoffs (and crazier things have happened), it will give the team confidence that can carry over to next year. Also, from the individual player’s standpoint, the average career is so short (3.1 years) and every game means so much, they all have much to play for over the next five weeks.”Murphy doesn’t mention that the head coach also has a strong incentive to win as many games as possible, in an effort to save his job. But that goes without saying, especially since Murphy says nothing in the column that would or could be interpreted as an indication that Mike McCarthy definitely will return in 2019.", "title": "Packers CEO: “I’m not ready to give up on the season”", "author": "Posted by Mike Florio", "date": "December 1, 2018, 11:47 AM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/11/30/week-13-injury-report-roundup-6/", "body": "Week 13 of the 2018 NFL season kicked off on Thursday with a win by the Cowboys and it continues with 14 more games on Sunday, which means that the 28 teams in those games submitted their final injury reports of the week on Friday.Questionable players are uncertain to play, doubtful players are unlikely to play and out should be self-explanatory. Players who are on active rosters and don’t appear below should be considered healthy enough to play barring any announcements on Saturday. The teams playing on Monday night won’t release their injury reports until Saturday and are not listed here.With that housekeeping out of the way, here are all the injury reports for Sunday.Ravens at FalconsRavens QB Joe Flacco (hip) returned to practice this week, but is listed as doubtful for Sunday. Safety Tony Jefferson (ankle) is out and T James Hurst (back) joins Flacco in the doubtful group. LB Tim Williams (illness), RB Gus Edwards (ankle), DB Anthony Levine (ankle), CB Tavon Young (groin) and RB Alex Collins (foot) are listed as questionable.The Falcons did not give out any injury designations on Friday, which means every player on the 53-man roster is considered healthy enough to play.Broncos at BengalsThe Broncos ruled out LB Shaq Barrett (hip) and CB Tramaine Brock (ribs) for Sunday. LB Brandon Marshall (knee) drew a questionable tag.WR Josh Malone (hamstring) and CB Tony McRae (concussion) have been ruled out by the Bengals. LT Cordy Glenn (back) is set to miss the game as well after getting listed as doubtful.Rams at LionsThe Rams did not hand out any injury designations in their return from a bye week. CB Aqib Talib (ankle) is set to play after being activated from injured reserve.The Lions ruled out RB Kerryon Johnson (knee), FB Nick Bellore (ankle) and WR Brandon Powell (calf). TE Michael Roberts (shoulder) is likely to join them on the inactive list after being listed as doubtful. WR Bruce Ellington (back) and LB Jalen Reeves-Maybin (neck) make up Detroit’s questionable contingent.Cardinals at PackersLB Deone Bucannon (chest) is out for the Cardinals and everyone else on the injury report is listed as questionable. That group includes S Budda Baker (knee), S Rudy Ford (heel), OL D.J. Humphries (knee), LB Haason Reddick (neck) and WR Chad Williams (ankle).LT David Bakhtiari (knee), LG Lane Taylor (quadricep), WR Randall Cobb (hamstring), CB Kevin King (hamstring) and CB Bashaud Breeland (groin) are listed as questionable for the Packers. DL Mike Daniels (foot), S Kentrell Brice (ankle, concussion), S Raven Greene (ankle), WR Trevor Davis (hamstring) and RB Tra Carson (rib) will not play this weekend.Bills at DolphinsThe Bills ruled out QB Derek Anderson (concussion) and G John Miller (oblique) for Sunday. TE Charles Clay (hamstring) is questionable.Dolphins WR Danny Amendola (knee) and C Travis Swanson (ankle) are listed as doubtful, so it’s unlikely they’ll be in Miami’s lineup. WR DeVante Parker (shoulder) and TE A.J. Derby (foot, knee) are listed as questionable.Bears at GiantsQB Mitchell Trubisky (shoulder), RB Benny Cunningham (ankle) and DB Sherrick McManis (hamstring) are not expected to play for the Bears after drawing doubtful tags. Defensive tackles Akiem Hicks (Achilles) and Bilal Nichols (knee) are listed as questionable.Giants TE Evan Engram (hamstring) and LB B.J. Goodson (neck) are out this week. LB Lorenzo Carter (hip) is listed as questionable.Panthers at BuccaneersWR Devin Funchess (back, not injury related) is the only player with a designation on the Panthers and he’s listed as questionable.The Buccaneers ruled out WR DeSean Jackson (thumb), CB M.J. Stewart (foot) and CB Carlton Davis (knee). T Demar Dotson (knee, hamstring) is listed as doubtful and four Buccaneers — LB Lavonte David (knee), S Justin Davis (toe), CB Brent Grimes (knee) and DT Rakeem Nunez-Roches (knee, ankle) — are listed as questionable.Colts at JaguarsTE Mo Alie-Cox (calf) and C Ryan Kelly (knee) are out for the Colts this weekend. S Mike Mitchell (knee), WR Chester Rogers (groin), TE Erik Swoope (knee), LB Darius Leonard (shoulder, knee), RB Marlon Mack (concussion) and DE Kemoko Turay (hip) make up the questionable group for Indy.CB Jalen Ramsey (knee) headlines a list of seven Jaguars listed as questionable. S Tashaun Gipson (ankle), S Cody Davis (hamstring), CB Tre Herndon (ankle), DE Lerentee McCray (hamstring), CB Quenton Meeks (knee) and OL Josh Walker (foot, ankle) round out the group. WR D.J. Chark (quad) is the only Jaguars player ruled out.Browns at TexansOL Austin Corbett (foot) won’t play for the Browns. S Damarious Randall (hamstring) and C J.C. Tretter (ankle) are questionable.Texans DE J.J. Watt (knee) is listed as questionable after a week of limited practices. WR Keke Coutee (hamstring) drew the same tag.Jets at TitansThe Jets listed quarterback Sam Darnold (foot) and wide receiver Robby Anderson (ankle) as questionable. Safety Marcus Maye (shoulder, thumb) will not play on Sunday.Titans RB David Fluellen (knee) and S Dane Cruikshank (knee) have been ruled out for Sunday.Chiefs at RaidersS Eric Berry (heel) may get his first game action of the year after being listed as questionable. WR Sammy Watkins (foot) is out this weekend.WR Martavis Bryant (knee), DT Maurice Hurst (ankle), DE Arden Key (knee) and CB Daryl Worley (shoulder) are considered questionable by the Raiders.Vikings at Patriots WR Stefon Diggs (knee) and CB Xavier Rhodes (hamstring) are listed as questionable by the Vikings, although Diggs said he’s playing and head coach Mike Zimmer suggested Rhodes would be in the lineup as well. CB Mackensie Alexander (knee) and WR Brandon Zylstra (foot) are also listed as questionable while WR Chad Beebe (hamstring) and TE David Morgan (knee) are out.The only Patriots player with an injury designation is TE Dwayne Allen. He’s out with a knee injury.49ers at SeahawksWR Pierre Garcon (knee), G Joshua Garnett (thumb), WR Marquise Goodwin (not injury related) and S D.J. Reed (heel, chest) have been ruled out by the 49ers.Seahawks RB C.J. Prosise (abdomen) and LB K.J. Wright (knee) will not play on Sunday. S Shalom Luani (quadricep) and RB Tre Madden (chest) are likely to join them after being listed as doubtful. DT Shamar Stephen (foot) is listed as questionable.Chargers at SteelersThe Chargers will play in Pittsburgh without T Joe Barksdale (not injury related), RB Melvin Gordon (knee) and DT Brandon Mebane (not injury related). WR Tyrell Williams (quadricep) is listed as questionable.T Marcus Gilbert (knee) was ruled out by the Steelers and S Morgan Burnett (back) is likely out after being listed as doubtful. LB Bud Dupree (pectoral) and CB Cameron Sutton (not injury related) have been listed as questionable.", "title": "Week 13 injury report roundup", "author": "Posted by Josh Alper", "date": "November 30, 2018, 5:56 PM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/11/30/nfl-still-needs-real-time-video-official/", "body": "The Cowboys barely won on Thursday night, the Saints barely lost. The officials, led by referee Walt Anderson, suffered a blowout.Various bad calls undermined a great game, with the most consequential blunder coming when Saints running back Alvin Kamara sustained the kind of hit that the new rule against lowering the helmet (as unofficially revised but not officially revised) was specifically aimed at eliminating from the sport. But no flag was thrown.There’s a good chance the call would have been missed even if the rule hadn’t been unofficially relaxed. Officials are still adjusting to a widening of the focus, watching one player approaching another and adopting the prohibited linear posture before making impact. Last night, Smith rocketed toward Kamara, and the seven officials who are primarily trying to avoid being trampled by young men in armor didn’t see it coming.That’s why the NFL needs to eventually embrace the use of an eighth member of the officiating crew. But that person wouldn’t be put on the field. Official No. 8 would sit at a bank of monitors, seeing every possible camera angle. Official No. 8 would be in constant contact with the referee or some other member of the on-field crew. Official No. 8 would serve as an extra set of eyes from the perspective of a viewer, bridging the gap between what the officials see from within the field and what the rest of us see from within our homes.It wouldn’t be part of the replay process, because it wouldn’t be replay review, per se. It would be an embrace of the primary manner in which pro football is consumed, and it would provide real-time assistance to the officiating crew from place of no physical peril.Eventually, it will happen. A blown call that affects a game and/or the application of the betting line will, as legal wagering spreads, force the league to make what should be an easy and obvious change. As hard-earned dollars legitimately ride on whether or not officials get it right, the league will face relentless pressure to get it right, all the time.For decades, the supposed purity of sport has embraced the impurity of human error. When the final score of sporting events begin to have the same relevance to American society as the rising and falling of stock prices, the challenge for sports leagues will be to take all steps necessary to eradicate human error from its games.Having a real-time video official who has the same standing as an official who is standing on the field would assist in that objective, while creating relatively minimal delays. And if the NFL doesn’t make this change on its own, some governmental body eventually will demand it.", "title": "NFL still needs real-time video official", "author": "Posted by Mike Florio", "date": "November 30, 2018, 11:14 AM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/11/30/nfc-playoff-picture-cowboys-win-boosts-the-rams/", "body": "The Cowboys gave their playoff hopes a big boost by beating the Saints on Thursday night. And they boosted the Rams as well.The Rams have leapfrogged the Saints and moved into the top spot in the NFC after New Orleans lost at Dallas. Although the Saints own the head-to-head tiebreaker and will earn the top seed if the two teams finish tied, the Rams are now a half game ahead of the Saints heading into Week 13.Here’s how the playoff picture looks after Thursday night:LEADERS\n1. Rams (10-1): They have an easy schedule the rest of the way, starting with Sunday at Detroit, so they have a good chance of finishing ahead of the Saints in the standings.2. Saints (10-2): Still the favorites to earn a bye week, but now they have an uphill climb to home-field advantage.3. Bears (8-3): The inside track to the No. 3 seed, but can they catch the Saints for a bye?4. Cowboys (7-5): Now owns sole possession of first place in the NFC East.5. Vikings (6-4-1): If they keep winning, they maintain a half-game lead in the wild card race.6. Washington (6-5): Owns the wild card tiebreaker over Seattle based on NFC record, and over Carolina based on head-to-head.OUTSIDE LOOKING IN\n7. Seahawks (6-5): Has the tiebreaker over Carolina thanks to Sunday’s head-to-head win.8. Panthers (6-5): Two straight losses in games they easily could have won have severely hurt their playoff chances.9. Eagles (5-6): Pulling out the comeback win against the Giants means they’re not dead yet in the NFC East.10. Packers (4-6-1): When they signed Aaron Rodgers to his huge new contract they thought they’d be playoff contenders for years to come. In Year One of the contract, they’re not.11. Falcons (4-7): Their Thanksgiving loss was the final nail in the coffin.12. Buccaneers (4-7): Jameis Winston‘s best game of the season was too little, too late.13. Lions (4-7): Their Thanksgiving loss was the final nail in the coffin.14. Giants (3-8): Stuck in last place in the NFC East.15. Cardinals (2-9): Swept the 49ers for their only two wins of the season.16. 49ers (2-9): The worst team in the NFC.", "title": "NFC playoff picture: Cowboys’ win boosts the Rams", "author": "Posted by Michael David Smith", "date": "November 30, 2018, 5:44 AM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/11/29/pfts-week-13-picks-9/", "body": "It’s the first non-bye week since September, with a full slate of 16 games. And MDS and yours truly agree on the outcome of every game.This means that a three-game spread will persist, with four weeks to go. After we each finished 8-4 on Sunday/Monday of Week 12, I’ve got a season-to-date record of 112-64 (63.6 percent). MDS is 109-67 (61.9 percent).Also, check out the weekly “best bets” video. Last Sunday, MDS and I were each 2-1.Saints at CowboysMDS’s take: The Cowboys could make a major statement in the NFC playoff race with a win here, but I just don’t see it happening. The Saints are too good.MDS’s pick: Saints 27, Cowboys 20.Florio’s take: Sean Payton reminds Jerry Jones why Jerry Jones may still eventually try to hire Sean Payton.Florio’s pick: Saints 34, Cowboys 17.Ravens at Falcons MDS’s take: The Falcons’ defense isn’t very good, but I have a feeling the Ravens’ offense is going to fail to exploit it, as Lamar Jackson will struggle. Atlanta takes this one at home.MDS’s pick: Falcons 23, Ravens 16.Florio’s take: Lamar Jackson takes his starting show on the road, and he quickly realizes that the Falcons aren’t the Bengals or the Raiders.Florio’s pick: Falcons 24, Ravens 14.Panthers at Buccaneers MDS’s take: Buccaneers quarterback Jameis Winston had his best game of the season last week, but Panthers quarterback Cam Newton will outplay him this week.MDS’s pick: Panthers 31, Buccaneers 21.Florio’s take: The Panthers get a good draw as they try to end a three-game losing streak.Florio’s pick: Panthers 41, Buccaneers 30.Bears at Giants MDS’s take: Chase Daniel over Mitchell Trubisky? I’m not sure it will make much difference. The Giants’ offense has been playing well recently, but not against the Bears.MDS’s pick: Bears 20, Giants 10.Florio’s take: It’s a trap game for the Bears, who will be facing a feisty Giants team that doesn’t care about winning its way to lower draft slots.Florio’s pick: Bears 23, Giants 20.Bills at Dolphins MDS’s take: The Bills look like they’re starting to get things going, but the Dolphins should be able to beat them at home.MDS’s pick: Dolphins 20, Bills 17.Florio’s take: Finally, a game the Dolphins should be able to win.Florio’s pick: Dolphins 20, Bills 10.Colts at Jaguars MDS’s take: The Jaguars’ offseason decision to commit to Blake Bortles was unwise, but that doesn’t mean benching him for Cody Kessler will be the answer, especially not against a Colts team that is playing very well right now.MDS’s pick: Colts 24, Jaguars 17.Florio’s take: The Colts possibly are becoming what the Jaguars were supposed to be.Florio’s pick: Colts 27, Jaguars 13.Browns at Texans MDS’s take: The Browns have definitely played better since firing Hue Jackson, but the Texans’ winning streak will keep going.MDS’s pick: Texans 24, Browns 14.Florio’s take: The Browns and Baker Mayfield could make this one interesting, but the Texans are simply too good.Florio’s pick: Texans 30, Browns 23.Broncos at Bengals MDS’s take: It’s a tough spot for new Bengals starting quarterback Jeff Driskel, as the Broncos are getting things turned around and potentially marching toward the playoffs.MDS’s pick: Broncos 28, Bengals 23.Florio’s take: The Broncos are unexpectedly surging, the Bengals are expectedly falling apart.Florio’s pick: Broncos 27, Bengals 17.Rams at Lions MDS’s take: Sean McVay has shown how quickly a good coach can turn around a bad team. Matt Patricia has shown how quickly a bad coach can make things worse.MDS’s pick: Rams 30, Lions 20.Florio’s take: The Rams keep pushing toward the playoffs, and the Lions keep pushing toward the NFC North basement.Florio’s pick: Rams 34, Lions 20.Cardinals at PackersMDS’s take: I don’t think the Packers are going anywhere this season, but they’re at least playing well enough that beating the Cardinals at home shouldn’t be a problem.MDS’s pick: Packers 24, Cardinals 10.Florio’s take: Poor Cardinals.Florio’s pick: Packers 38, Cardinals 13.Chiefs at Raiders MDS’s take: The Chiefs are the best team in the AFC and the Raiders are the worst team in the AFC. Enough said.MDS’s pick: Chiefs 31, Raiders 13.Florio’s take: One of the NFL’s best rivalries won’t be on Sunday.Florio’s pick: Chiefs 37, Raiders 16.Jets at Titans MDS’s take: It’s getting rough for Todd Bowles as he heads into what looks like his last month as the Jets’ head coach. Another loss should just about seal it.MDS’s pick: Titans 28, Jets 14.Florio’s take: The Titans face an uphill climb to get to the playoffs, but they’ll hold serve against an inferior team.Florio’s pick: Titans 27, Jets 17.49ers at Seahawks MDS’s take: The Seahawks are playing hard and appear to be heading toward the playoffs in what easily could have been a rebuilding year. That’s a credit to Pete Carroll.MDS’s pick: Seahawks 34, 49ers 20.Florio’s take: Richard Sherman returns home with a chance to spoil a Seattle playoff run. Unfortunately for Sherman, there aren’t enough players as talented as Sherman around him.Florio’s pick: Seahawks 24, 49ers 13.Vikings at Patriots MDS’s take: One of the best games of the day feels like it could go either way, but I like the Patriots to pull it out late.MDS’s pick: Patriots 24, Vikings 21.Florio’s take: Vikings simply don’t match up well with a Patriots team that matches up well with pretty much everyone. This could get ugly.Florio’s pick: Patriots 31, Vikings 20.Chargers at Steelers MDS’s take: This is a very big one in the AFC playoff race, perhaps a must-win for the Chargers if they have any hope of catching the Chiefs in the AFC West. I don’t think it’s going to happen.MDS’s pick: Steelers 21, Chargers 20.Florio’s take: Austin Ekeler will need to step up if the Chargers will have a chance to win this one. Even if he does, the Steelers are still good enough to get their act together after an unexpected loss in Denver.Florio’s pick: Steelers 27, Chargers 23.Washington at EaglesMDS’s take: I was ready to write off the Eagles a couple weeks ago. I’m not anymore. I’m expecting a three-way tie atop the NFC East after Week 13.MDS’s pick: Eagles 20, Washington 17.Florio’s take: Every week it seems there’s another NFC East favorite, with Dallas losing to the Saints, the Eagles can make it a three-day tie for now, setting up for another showdown in Dallas next weekend.Florio’s pick:  Eagles 31, Washington 17.", "title": "PFT’s Week 13 picks", "author": "Posted by Mike Florio", "date": "November 29, 2018, 11:56 AM EST"},
{"url": "https://profootballtalk.nbcsports.com/2018/11/28/saints-rams-and-chiefs-can-clinch-playoff-berths-this-week/", "body": "No team has booked a spot in the postseason yet, but there could be three teams making plans for the playoffs by the time Week 13 comes to an end.The NFL has released this week’s playoff scenarios and it shows that two of those teams could also wind up locking up division titles. The Saints will have the NFC South crown with a win and a Panthers loss or tie or a tie and a Panthers loss.The Rams had a chance to clinch the NFC West during their bye week, but the Seahawks’ win against the Panthers meant they had to wait. A Rams win, a Seahawks loss or ties in both of their games to win their second straight divisional championship. The Rams have several scenarios that involve clinching a playoff berth while tying the Lions, but a win or a Seattle loss remains the most likely way for them to book passage to the postseason before Week 14.The Saints will be in the playoffs with a win. There are other scenarios that get them in if they tie the Cowboys, but none if they should lose in Dallas on Thursday night.Over in the AFC, the Chiefs are the only team in position to clinch a playoff berth. For that to happen they will need to beat the Raiders and get a fair amount of help from other results around the AFC. Those scenarios are listed below:1) MIA loss or tie + IND loss + HOU loss + TEN loss or tie2) MIA loss or tie + IND loss + HOU loss or tie + BAL loss or tie + CIN loss or tie3) MIA loss or tie + IND loss + HOU loss or tie + BAL loss + LAC loss", "title": "Saints, Rams and Chiefs can clinch playoff berths this week", "author": "Posted by Josh Alper", "date": "November 28, 2018, 2:22 PM EST"}
]