[
{"url": "https://www.npr.org/2018/10/30/662120808/klay-thompson-breaks-nbas-3-point-record-held-by-teammate-stephen-curry", "body": "\n                Golden State Warriors guard Klay Thompson shoots the ball against Chicago Bulls forward Justin Holiday (7) and guard Zach LaVine (8) during Monday night's game. Thompson broke the NBA's single-game record for 3-pointers.\n                \n                \n                \n            Golden State Warriors guard Klay Thompson shoots the ball against Chicago Bulls forward Justin Holiday (7) and guard Zach LaVine (8) during Monday night's game. Thompson broke the NBA's single-game record for 3-pointers.Golden State Warriors' Klay Thompson had only made five 3-point shots throughout the first seven games of the 2018 NBA season. He made 14 Monday night — in one game.With that, the 28-year-old shooting guard broke an NBA record previously held by teammate Stephen Curry for the most 3-pointers in a game and the Warriors improved to 7-1. of the performance display an in-sync and supportive team having fun, and it is actually Curry who delivers the assist to Thompson for his 13th 3-pointer, which tied the record.Klay Thompson (52 PTS) ERUPTS for the , knocking down an  RECORD 14 3-pointers!   After scoring 10 3-pointers in the first half, Thompson received some words of encouragement from Curry.\"Its funny actually 'cause you think it's like a no-hitter or a perfect game in baseball, no one wants to say anything to you. But the first thing out of Steph's mouth is, 'Go get that record bro,' and I'm like 'OK, if you insist,' \" Thompson told ESPN's Scott Van Pelt. \"I'm so lucky to be on a team like this.\"To make the feat even more impressive, the record-setter didn't even play in the fourth quarter. Thompson was taken out in the third quarter after setting the record — his team holding a commanding lead over the Chicago Bulls. He scored a total of 52 points in his 27 minutes of play in the game, which the Warriors won, 149-124. Curry wasn't the only one cheering Thompson on. Fellow Warriors' teammate Draymond Green's mother  her admiration. KLAY has changed the direction of the WIND in Chicago! Javale McGee, a former teammate who is known for some questionable style choices, accused Thompson of appropriating his \"swag\" before  congratulations.   u just gone steal my swag and hit 14threes... its the headband and beard for sure! 👌🏽 CONGRATS BRO While basketball fans on social media were no doubt impressed, it is perhaps Curry who is still the most smitten. In  taken in the locker room after the game and posted on social media, Curry takes a look at the box score before affectionately gazing at his teammate.Klay Thompson set an NBA record with 14 threes. But Steph Curry wins the night with this Instagram post.  The duo of Curry and Thompson is known as the \"Splash Brothers\" and what is either their bromance or sibling rivalry continues Wednesday against the New Orleans Pelicans. ", "title": "Klay Thompson Breaks NBA's 3-Point Record Held By Teammate Stephen Curry", "author": "Ruben Kimmelman", "date": "October 30, 20181:25 PM ET"},
{"url": "https://www.npr.org/2018/11/17/668582123/not-my-job-we-quiz-orlando-magic-star-aaron-gordon-on-actual-magic", "body": "We recorded the show in Orlando, Fla., this week so we've invited NBA star Aaron Gordon of the Orlando Magic to play a game called \"Abracadabra!\" Three questions about great magicians.PETER SAGAL, HOST: And now the game where famous people are asked about obscure things. We call it Not My Job. People who visit Orlando are excited about the theme parks like Dinosaur World and Gatorland.(CHEERING)SAGAL: But the people who live here are most excited about their basketball team, their Orlando Magic, and its star small forward...(APPLAUSE)SAGAL: ...Aaron Gordon. Aaron joins us now.Aaron Gordon, welcome to WAIT WAIT... DON'T TELL ME.AARON GORDON: Oh, thank you. I appreciate you having me on.SAGAL: It's great to have you.GORDON: All right. All right. All right.SAGAL: You've got fans. I've got to ask you - I should admit I'm not, you know, conversant with, like, the basketball stuff - how is it that someone the size of the Statue of Liberty...(LAUGHTER)SAGAL: ...Is a small forward?(LAUGHTER)GORDON: I would like to think of myself as a powerful small forward...SAGAL: Right.GORDON: ...You know? It's just, like, kind of a mix of a couple of different things.SAGAL: Is it, like, a power forward, and then there's a small forward?GORDON: Yeah, exactly.SAGAL: Yeah.GORDON: So it's kind of like a lot of - maybe a hyphen in it.SAGAL: Hyphen? Yeah, OK. Yeah.(LAUGHTER)MO ROCCA: Is the power forward more of a ball hog? Because it sounds like the small forward is nicer and shares the ball more.(LAUGHTER)SAGAL: Yeah.GORDON: When it comes to rebounding, yes. A power forward can just be as ball hog-ish (ph) as he'd like to be.(LAUGHTER)SAGAL: Now, we found out something interesting. You did a lot of sports growing up, as we might expect from a guy of your talents, but you also played hockey.GORDON: Yes.(CHEERING)GORDON: Yes - ice hockey.SAGAL: So what ultimately made you choose basketball over hockey?GORDON: I just kind of had a natural affinity for basketball.SAGAL: Your whole family...GORDON: Yeah.SAGAL: ...Is a family of basketball players. Your parents play? Your father play?GORDON: Yeah. Dad played at San Diego State.SAGAL: Yeah.GORDON: And...SAGAL: And your brother plays pro ball.GORDON: He played pro ball overseas. He's been to a bunch of places. So he plays, and then my sister played at Harvard...SAGAL: Right.GORDON: So she was a Harvard basketball player. And I was.(APPLAUSE)SAGAL: Right. So I imagine your friendly games at home are absolutely vicious.GORDON: Oh, my gosh. Oh, they were...(LAUGHTER)GORDON: ...Gruesome at times.SAGAL: Really? You guys - because I know that one of the things the NBA is known for is trash talk. Do you trash-talk your siblings?GORDON: Oh, definitely.SAGAL: All right. Tell me something.(LAUGHTER)SAGAL: All right. Let's go with what you say to your sister.(LAUGHTER)GORDON: It's kind of like the saying - I'm the youngest...SAGAL: Right.GORDON: So, just by nature, I'm the most annoying.SAGAL: Right. Of course.(LAUGHTER)SAGAL: That's your role. I have a younger brother. Yeah.GORDON: More like, nah-nah-nah-nah-nah, I'm better. You're not. You know what...SAGAL: Yeah.GORDON: ...I mean? Along the lines of...SAGAL: Yeah.GORDON: Yeah.SAGAL: Yeah. I mean...GORDON: That's about it.SAGAL: I mean, just do you, like, leave your NBA contract out on a table?(LAUGHTER)SAGAL: Oh, I'm sorry. I left this here. Let me pick it up.(LAUGHTER)SAGAL: Oh, some money fell out of my pocket. Let me grab that, as well.(LAUGHTER)SAGAL: So here you are in Orlando. You're playing ball. What kind of town is it for playing basketball?GORDON: It's a great city. It's...(CHEERING)GORDON: ...You guys are awesome.SAGAL: I've always wondered about this because everybody knows that sports fans get very passionate. Do you guys care as much as, like, we do about whether you win or lose?GORDON: Oh, man. That's a great question. You know...(LAUGHTER)GORDON: It's - they're really fanatics, you know what I mean...SAGAL: Yeah, I know.GORDON: ...In every sense of the word, you know?SAGAL: Yeah.GORDON: They're - I think they care about it equally if not more than we do.SAGAL: Really?GORDON: Yeah. Yeah.SAGAL: Do you ever feel like looking over at the fans and going, guys, it's a game. Nobody died.(LAUGHTER)SAGAL: We're all actually friends.GORDON: Yeah. They, like, look me in my eyes and say, I hate you.(LAUGHTER)SAGAL: Really?GORDON: Whoa. I don't think I did anything to deserve that, but, you know...(LAUGHTER)GORDON: I'm just going to cordially beat your team, but...SAGAL: OK. All right.(LAUGHTER)SAGAL: I actually - one of the - this - I guess hockey, the fans are closer because they're on the other side of the glass, but there's glass. You guys are, like, closest to the fans of any professional sport. You actually sometimes fall on top of them.GORDON: Yes.SAGAL: And is that weird? I mean, because if you're - like, has one guy in - like, sitting down front like a Jack Nicholson type ever, like, said something to you, like, right in your face?GORDON: Oh, no. See, I think they understand that there's no barrier.SAGAL: Right.GORDON: You know what I mean? So in hockey, there's that glass barrier.SAGAL: Yeah.GORDON: You know, it's kind of like having two dogs on opposite sides of the gate.SAGAL: Yeah.GORDON: You know? Like, they're, like, barking at each other.SAGAL: Yeah. Yeah.GORDON: But then, when you leave the gate, they're, like, oh, OK. Just, you know, sniff each other.(LAUGHTER)GORDON: So there's no barrier, so the fans kind of keep it to themselves because, you know, we have access to them.(LAUGHTER)ROCCA: Have you ever had to console a fan that was upset with your performance?(LAUGHTER)GORDON: Oh, definitely.ROCCA: And how do you do that? How do you approach that?GORDON: Hey, it's OK. I understand. You're very into this game right now.(LAUGHTER)GORDON: But I'm going to continue to do what I do.SAGAL: Right.(LAUGHTER)GORDON: So, like - and they're like...(APPLAUSE)GORDON: OK. You know, OK. They don't really talk after that.SAGAL: Yeah. You are known for your enthusiasm for the slam dunk contest.GORDON: Yes.SAGAL: Yes.GORDON: Yes.SAGAL: And...(APPLAUSE)SAGAL: You did a slam dunk in which you vaulted on top of and then over the mascot. And you just - did you just go up to the mascot and say, you're just going to stand there, and I'm going to jump up, put my hands on your head and go over you, and you're going to hold up the ball. And the mascot was, like, OK.(LAUGHTER)GORDON: Pretty much.SAGAL: The mascot - is he, like - the mascot does not say no to Aaron Gordon.GORDON: It's actually - it's really funny because Stuff the Magic Dragon - he's a great mascot. You know what I mean?(CHEERING)GORDON: He's a great mascot. He is. He's this, like, green dragon. He has these stars on the top of his head. And, when I was practicing, I couldn't get the grip of the ball right. So I was, like, Stuff, buddy...(LAUGHTER)GORDON: You might need to take the stars off your head. And he was really going to take one for the team. He was a team player. And we did it, and I got the dunk. But I could just see the sadness in this mascot...(LAUGHTER)GORDON: ...In his body language - like he had lost a part of himself with the stars. You know, so...SAGAL: Stuff...GORDON: Yeah. So we were, like, OK. We put the stars back on his head. Just - I had to make it work for the sake of him.(LAUGHTER)SAGAL: That's a heartwarming story.GORDON: Yeah.(APPLAUSE)GORDON: That's my good friend these days.SAGAL: Well, Aaron Gordon, we've invited you here to play a game we're calling...BILL KURTIS: Abracadabra.SAGAL: You play for the Orlando Magic, but what do you know about the real magic - by which we mean magic shows?(CHEERING)SAGAL: We're going to ask you three questions about great magicians. Answer two of them correctly, and you will win our prize for one of our listeners - the voice of their choice on their voicemail. Bill, who is Aaron playing for?SAGAL: Hal Ray of Tampa, Fla.(CHEERING)GORDON: OK - Florida boy. All right. Here we go.SAGAL: All right. Here's your first question. One of the great magicians of the late 19th century was Harry Kellar. How did Kellar learn to do his greatest trick, the levitating woman? Was it, A, he was a practicing Buddhist who attained enlightenment and was given control over gravity...(LAUGHTER)SAGAL: ...B, he tied the woman to a thousand trained fleas, who flew her upward...(LAUGHTER)SAGAL: ...Or C, he walked up on stage while another magician was doing the trick, ran around back to see what was done and then ran away.GORDON: I'm going to go with the latter one.SAGAL: You're correct.(SOUNDBITE OF BELL)GORDON: All right. I like that. I like that.(APPLAUSE)SAGAL: It was pretty daring, but that's how you get to be a legend of magic. All right. Second question - let's see if you do as well. Another great magician of that golden era of magic was Carter the Great, and one of his famous tricks was which of these? A, the magical divorce, a trick in which he made his own wife disappear...(LAUGHTER)SAGAL: ...B, the disappearing theater in which the entire audience found itself in a suddenly vacant lot sitting on their butts; or C, the vaguely disquieting meal in which Carter ate an ear of corn raw.(LAUGHTER)GORDON: I think I'm going to go with B.SAGAL: You're going with B - the disappearing theater. All of a sudden, everybody was out there sitting on their butts in a field.GORDON: That's the one.SAGAL: That's the one. He picked it. Sadly, he missed this shot. No, I'm afraid.GORDON: Oh, dang.SAGAL: It was actually the magical divorce. He made his wife disappear. His wife eventually decided that wasn't funny.(LAUGHTER)GORDON: So she's still around.SAGAL: She's still around. She stayed married to him...GORDON: OK.SAGAL: But he changed the name of the trick to the phantom bride. So this is your last question. If you get this right, you win.GORDON: OK.SAGAL: Some magicians have been able to use their skills in real life such as in which of these? A, Doug Henning, who used to skip out on dinner checks by making himself disappear during dessert...(LAUGHTER)SAGAL: ...B, Penn Jillette, who for three years has made himself look like he's lost a hundred pounds by constantly surrounding himself with trick mirrors...(LAUGHTER)SAGAL: ...Or C, David Copperfield, who once made his wallet disappear while he was being mugged.GORDON: I'm going to go with Copperfield. It's C.SAGAL: You're going to go David Copperfield. That's right, Aaron.(SOUNDBITE OF BELL)GORDON: Yay.(APPLAUSE)GORDON: Thanks.SAGAL: He says he was being mugged outside walking to his car after a performance. Some guy came up, tried to mug him, and he made his watch, wallet and passport disappear.(LAUGHTER)GORDON: Oh, man.SAGAL: Bill, how did Aaron do on our quiz?KURTIS: Two out of three is a win.SAGAL: Congratulations.(APPLAUSE)GORDON: Thanks.SAGAL: Aaron Gordon is the small forward for the Orlando Magic. Aaron Gordon, thank you for joining us on WAIT WAIT... DON'T TELL ME. Aaron Gordon, everybody.GORDON: All right.(SOUNDBITE OF SONG, \"MAGIC\")B.O.B.: (Singing) I've got the magic in me. Every time I touch that track, it turns into gold. Everybody knows I've got the magic in me.SAGAL: In just a minute, Bill sits on his phone in the Listener Limerick Challenge. Call 1-888-WAIT-WAIT to join us on the air. We'll be back in a minute with more of WAIT WAIT... DON'T TELL ME from NPR.Copyright © 2018 NPR.  All rights reserved.  Visit our website  and  pages at  for further information.NPR transcripts are created on a rush deadline by , an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.", "title": "Not My Job: We Quiz Orlando Magic Star Aaron Gordon On Actual Magic", "author": "", "date": "November 17, 201811:18 AM ET"},
{"url": "https://www.npr.org/2018/11/14/667936235/suzy-whaley-pga-of-americas-first-female-president-outlines-her-vision-for-golf", "body": "\n                Golf professional Suzy Whaley is set to become the first female president of the PGA of America.\n                \n                \n                \n            Golf professional Suzy Whaley is set to become the first female president of the PGA of America.Growing up in Syracuse, N.Y., Susan Whaley played golf on a boys' high school team. Title IX had given her and other young women athletes more opportunities. Still, because she was a girl, Whaley was barred from competing in the team's tournaments.\"That just was a sign of the times — it just is how it was,\" she says. \"And then fast-forward ... and I am allowed to play in a PGA Tour event.\"Whaley became the first woman in 58 years to qualify for a PGA tournament when she made the 2003 Greater Hartford Open. The athlete broke her latest barrier this past weekend when she was elected president of PGA of America, the first woman to hold the position in the association's 102-year history. Just 40 years ago, women couldn't even be members.\"Obviously the historic nature of it doesn't go past me,\" she says. \"I'm so honored and grateful to have that chance, and to have the trust of my 29,000 members and peers.\"For Whaley — who also serves as the PGA director of instruction at the Country Club at Mirasol in Palm Beach Gardens, Fla. — being elected was never about being a trailblazer: \"It's always been about wanting to play the game.\"That said, it doesn't hurt being an inspiration to women who want to play a sport known for its exclusivity.\"We still need more women playing the game, and to feel welcome at playing the game,\" she says. \"If young women can see themselves in the business because they see me in the role — as I saw other women before me who opened the doors for me — then in that sense I'm thrilled to be a woman in the job.\"In an interview with NPR's Ailsa Chang, Whaley expands on the challenges she has faced, and on her visions for the future of professional golf.It is a large disparity. And, you know, the LPGA Tour has become global for many reasons. You know, we have amazing female golfers from all over the world participating now in the game at the highest level. And oftentimes many of their purses overseas sometimes are even higher than they are domestically [not for the U.S. Open and not for the KPMG women's PGA championship]. A lot of it has to do with television dollars and digital-rights dollars and worldwide sponsors.We need more women and more men to watch ladies' golf. We need them to turn the channel on; we need them to buy into the fact that these are the best athletes in the world. ... What I try to share with the people I teach and coach, and the people that I'm around in the industry, is oftentimes the women's game is much more compatible to that of a really strong club player — and I don't mean that with disrespect. ...A lot of people can relate to their swing speeds. A lot of people can learn from them by watching them play. They have shots around the greens that they have to have, because oftentimes they aren't hitting short irons in like some of the men are. And oftentimes that's comparable to people who are playing the game at clubs around the country and at daily fee facilities around the country.And once somebody goes to an LPGA event, once somebody goes to the KPMG Women's PGA Championship, they're hooked! They are hooked on women's golf.With scholarship opportunities to our [PGA Golf Management] universities that we have 19 of around the country. And we're making strides — it's not fast enough, but we're making strides. ... I learned from a male golf professional, and I loved that, but there are many people who prefer to be with somebody that looks like them when they first get started in something new. And if we can have that opportunity for more people we will make greater strides.We have PGA junior league, which is a huge evolving program of 50,000 boys and girls across the country playing PGA junior league golf. They play together — boys and girls from the same tee. ... We have close to 35 percent girls playing — we want it to be 50, but we're getting there — and then we have almost 25 percent of those of color playing.", "title": "Suzy Whaley, PGA's First Female President, On Bringing Inclusivity To Golf", "author": "Emma Bowman", "date": "November 14, 20184:24 PM ET"},
{"url": "https://www.npr.org/2018/11/05/664578266/usa-gymnastics-dumped-as-organizers-of-olympic-athletes-after-sexual-abuse-scand", "body": "\n                Simone Biles of the U.S. shows her gold medal after the women's vault final at the gymnastics World Championships in Doha, Qatar, last week.\n                \n                \n                \n            Simone Biles of the U.S. shows her gold medal after the women's vault final at the gymnastics World Championships in Doha, Qatar, last week.The U.S. Olympic Committee has taken preliminary steps to revoke USA Gymnastics' status as the governing body for the sport after it fumbled attempts to reorganize after a sexual abuse scandal.In an open letter to the U.S. gymnastics community, U.S. Olympic Committee , \"You deserve better.\" Invoking the decertification process would usher in new leadership, she added, acknowledging that the interim period could be rocky: \"I do not know how long the process will take, and we will make every effort to proceed quickly.\"This dramatic step can be traced to the scandal that rocked the sport last year, when it came to light that a former team doctor, Larry Nassar, had abused hundreds of athletes under the guise of medical treatment. He is now serving the equivalent of a life sentence in prison.The organization has cycled through three leaders in less than two years. Former USA Gymnastics CEO Steve Penny, who presided over the organization during Nassar's tenure, resigned in early 2017. Last month,  for allegedly tampering with evidence related to the Nassar case. He has pleaded not guilty.Penny's two successors were also pressured to step down. , a former member of the U.S. House, lasted less than a week as interim CEO before resigning last month. On social media, Bono had criticized Nike for featuring football quarterback Colin Kaepernick in an ad campaign. Kaepernick has knelt at NFL games to protest police brutality and discrimination against African-Americans., the biggest star in gymnastics and a Nike-sponsored athlete, took to Twitter to register her disapproval of Bono's since-deleted tweet.Bono resigned shortly afterwards. Before her, the job was held for less than a year by .Despite the USOC's move, the  said it would continue to serve the gymnastics community: \"Our commitment will always be to ensure the health and safety of our members while they pursue their love of the sport.\"Despite the disarray at USA Gymnastics, the female team has triumphed in international competitions. They dominated at the World Championships last week, and Biles took home four gold medals.", "title": "Olympic Officials Move To Dump USA Gymnastics As Organizers Of Olympic Athletes", "author": "Alexandra Starr", "date": "November 5, 201810:35 PM ET"},
{"url": "https://www.npr.org/2018/11/05/664232524/no-athletes-will-not-shut-up-and-dribble-and-they-never-have", "body": "\n                Oscar Robertson is one of the athletes who's interviewed in the new documentary series .\n                \n                \n                \n            Oscar Robertson is one of the athletes who's interviewed in the new documentary series .The new documentary series , which premiered the first of its three parts this weekend on Showtime, is a response to commentator Laura Ingraham's dismissive February 2018 , one of the series' executive producers. Don't take my word for it that it's a direct response: watch the opening sequence in which Ingraham, disgusted by James and other black athletes speaking out against President Donald Trump, says that nobody elected them, nobody wants to hear from them, and they should, yes, just \"shut up and dribble.\" The idea that athletes — or actors, or writers — shouldn't be politically active in the public sphere is surprisingly widely held. The point of the series is to demonstrate that in the case of black athletes, holding the game at a distance from the society in which it's played is not only contrary to history but impossible. And, perhaps, that it would be irresponsible.Narrated by writer Jemele Hill and directed by Gotham Chopra, uses its first installment to chronicle several of professional basketball's early standouts who collided with the wider world in different ways: Bill Russell, Kareem Abdul-Jabbar, Oscar Robertson, and Isaiah Thomas. It follows the NBA through a period in the 1970s when some worried that the increasing number of black players was alienating white audiences — a crisis the end of which it credits to the hugely popular rivalry between Magic Johnson and Larry Bird. To that picture, adds the story of the Detroit Pistons and of Thomas, whose comments on how racism influenced the perception of Bird became very controversial, to the point where the broader observation he was making — about who is considered simply a \"natural talent\" and who is considered a \"smart player\" — was lost. People who have watched a lot of NBA documentaries, or who have watched projects like that try to look at the intersection of sports and the world at large, will know a good number of these stories, maybe including the stories of Russell and Robertson, and how Bird was called \"the great white hope\" whether he wanted to be or not, and how his rivalry with Johnson had — as one commentator wildly understates it — a \"tinge\" of racial dynamics in it. But there are good segments in the first installment that might be less familiar about the way the ABA and the NBA presented basketball very differently, the way labor issues among players were (and are) inextricably linked to race, and the way Abdul-Jabbar — now a columnist, a comic book writer, and a writer on the upcoming revival of  — decided to decline to try out for the 1968 Olympics. The next two installments follow the NBA through later phases, up to the present. They consider the era of Michael Jordan and the explosion of endorsement deals — which, the film's interviewees suggest, tamped down public discussions of politics as protection of each athlete's personal brand became critical. They examine the career of Allen Iverson, whose path to the NBA — and his clothes and hair and tattoos and connections to hip-hop — made him a beloved figure to a lot of fans who perhaps didn't relate to Michael Jordan or Magic Johnson. Critically, the series at one point turns its attention to the 2004 Pacers-Pistons fight — the one that spilled into the stands — that led to long suspensions, including for Metta World Peace (who then went by Ron Artest). It's a necessary chapter in part because it's impossible to consider the public activism, and the significance of public activism, of black athletes without recalling how easily after this incident commentators slipped into calling players \"thugs,\" and how that fight seemed to surface ugly attitudes about players that had been simmering in sports media and in the NBA itself. Again, players have never had the option of shutting up and dribbling; they, like everyone, live and work in a particular social context. And it's a context in which racism affects the way they're talked about, the way they're treated, and the way their behavior is received.And yes, we eventually reach the Obama years, and then the 2016 election. We reach Trayvon Martin and Eric Garner, and we learn that LeBron James' decision to go to the Miami Heat — not the ill-advised TV special, but the choice itself — may have affected the power balance between players and owners in a way that's made activism for players safer. That, of course, goes back to Oscar Robertson's fight for free agency chronicled in the first episode, too.This is what good documentaries do: they provide an overview, but they also make interesting connections between specific pieces of the story. While it's about activism and racism, much of this series is about power. Power accumulated by players, whether it's the economic power of endorsements or the bargaining power of free agency, directly enables them to use their platforms without worrying that they'll be, for instance, let go from their teams and unable to get new jobs because a political stand they consider crucial proves to be unpopular, or makes them targets. An unspoken thesis of the series is that the concept of athletes not belonging in politics is about discomfort with, and resentment of, that considerable power. It's a strange idea, this expectation that players must entertain and not speak. The NBA is a business that makes ridiculous money for mostly white owners from the work of many black athletes. It's fed by the NCAA, which makes ridiculous money for schools from the work of many black athletes. It's covered by a disproportionately white sports media, and it's regulated by a mostly white political system. is a good exploration of all the ways that black athletes couldn't remain apart from racism or politics even if they wanted to — which, as it happens, many of them don't. ", "title": "No, Athletes Will Not 'Shut Up And Dribble' — And They Never Have", "author": "Linda Holmes", "date": "November 5, 20185:00 AM ET"},
{"url": "https://www.npr.org/2018/11/04/664215594/kenyas-mary-keitany-and-lelisa-desisa-of-ethiopia-win-new-york-city-marathon", "body": "\n                First place finishers Mary Keitany of Kenya, left, and Lelisa Desisa of Ethiopia pose for a picture at the finish line of the New York City Marathon on Sunday.\n                \n                \n                \n            First place finishers Mary Keitany of Kenya, left, and Lelisa Desisa of Ethiopia pose for a picture at the finish line of the New York City Marathon on Sunday.At the New York City Marathon on Sunday, the race's top long-distance runners greeted an ideally brisk and sunny fall morning with near record times.It was a day of many personal firsts, as a field of more than  sought to push their way through the city's five boroughs in the annual race.Lelisa Desisa of Ethiopia won the men's race — his first in New York — in 2 hours, 5 minutes, 59 seconds.\n                Lelisa Desisa, of Ethiopia, crosses the finish line first in the men's division of the NYC Marathon.\n                \n                \n                \n            Lelisa Desisa, of Ethiopia, crosses the finish line first in the men's division of the NYC Marathon.\"This is my dream,\" Desisa, 28, said after the race, The Associated Press reported. \"To be a champion.\"Shura Kitata, also of Ethiopia, took second place in the men's race with a time of  2:06:01. Last year's title defender, Kenya's Geoffrey Kamworor, was favored to win going into the race, but ultimately placed third with a time of 2:06:26.In the women's race, fellow Kenyan Mary Keitany, 36, became the third person to win the NYC marathon four times, according to . She ran the course in 2:22:48, the second fastest time for a female runner in NYC marathon history. Kenya's Margaret Okayo's record of 2:22:31 from 2003 remains unbroken.\n                Mary Keitany of Kenya is first to finish the women's NYC Marathon.\n                \n                \n                \n            Mary Keitany of Kenya is first to finish the women's NYC Marathon.Keitany said that setting a course record was never on her mind, according to the AP. She just wanted to win. \"For me, winning was the most important,\" she said.Keitany outran Vivian Cheruiyot, 35, of Kenya, who came in at 2:26:02. American Shalane Flanagan, 37, who finished third with a time of 2:26:22, ran faster than last year when she won the race. In the wheelchair division, Daniel Romanchuk became the first American to win the men's race, finishing in 1:36:21. Switzerland's Marcel Hug trailed about one second behind Romanchuk, followed by David Weir of Britain, to round out the top three. \n                Daniel Romanchuk of the United States poses for a picture after crossing the finish line first in the men's wheelchair division.\n                \n                \n                \n            Daniel Romanchuk of the United States poses for a picture after crossing the finish line first in the men's wheelchair division.Manuela Schar of Switzerland won the women's wheelchair division for the second time, at 1:50:27. Tatyana McFadden of the U.S. finished as runner-up at  1:50:48 and Lihong Zou of China came in third.", "title": "Kenya's Mary Keitany And Lelisa Desisa Of Ethiopia Win New York City Marathon", "author": "Emma Bowman", "date": "November 4, 20189:16 PM ET"},
{"url": "https://www.npr.org/2018/11/02/663594281/nfl-cheerleader-kneels-during-national-anthem", "body": "\n                Military planes fly over Levi's Stadium on Thursday during the playing of the national anthem. A cheerleader took a knee during the pre-game anthem, and may be the first NFL cheerleader to do so.\n                \n                \n                \n            Military planes fly over Levi's Stadium on Thursday during the playing of the national anthem. A cheerleader took a knee during the pre-game anthem, and may be the first NFL cheerleader to do so.A cheerleader for the San Francisco 49ers knelt during the U.S. national anthem on Thursday evening, just before a game against the Oakland Raiders. The woman has not been identified, and her decision to kneel echoes player protests against racism and police brutality. Football player Colin Kaepernick started the protests when he kneeled during a pre-game anthem in 2016. He is a former player for the 49ers. Spectators photographed the cheerleader kneeling while the rest of her squad held up pom-poms in unison during the Star Spangled Banner. One of the Niners cheerleaders is taking a knee. NBC reporter Damian Trujillo also tweeted a shot of the cheerleader kneeling on one knee, with her hands on her hips. Close up: cheerleader takes a knee during  This may be the first time an NFL cheerleader has kneeled during the anthem. Cheerleaders for college-level football teams have kneeled in protest before. Last year five members of Kennesaw State University's cheerleading squad in Georgia knelt during the national anthem.  reported that four of the five cheerleaders were not asked back on the team. Kaepernick left the 49ers in 2016, and still has not signed on with another team. He is suing the NFL for allegedly freezing him out of playing professional football because of his activism. ", "title": "NFL Cheerleader Kneels During National Anthem", "author": "Shannon Van Sant", "date": "November 2, 20183:28 PM ET"},
{"url": "https://www.npr.org/2018/10/31/662801623/hall-of-fame-slugger-willie-mccovey-dies-at-age-80", "body": "\n                Willie McCovey stretches for a throw during the 1962 World Series between the San Francisco Giants and New York Yankees.\n                \n                \n                \n            Willie McCovey stretches for a throw during the 1962 World Series between the San Francisco Giants and New York Yankees.Hall of Fame first baseman and one of the most beloved former members of the San Francisco Giants,  died Wednesday.His death at age 80 was . The team didn't specify an exact cause of death, citing instead \"on-going health issues.\"McCovey was nicknamed \"Stretch\" because his height at 6-foot-4. Left-handed throwing made him a natural at first base. He was best known for his 521 career home runs, 18 of which were grand slams — the most by any player who spent his career . McCovey was the National League's home run leader three times and RBI king twice in his 22-season career. He played 13 of those years on the Giants with teammate  and together they formed one of the most powerful hitting duos in baseball history.It is with great sadness that we announce that San Francisco Giants Legend and Hall of Famer Willie McCovey passed away peacefully this afternoon at the age of 80 after losing his battle with ongoing health issues.   |  A native of Mobile, Ala., McCovey announced his arrival in baseball's major leagues in July 1959 when he debuted batting  hitting two triples and two singles, scoring three runs and batting in two other runs. He batted .354 overall and won the National League's Rookie of the Year award despite playing only 59 games that season.Ten years later in 1969, McCovey was the NL's Most Valuable Player, after leading the league with 45 home runs, 126 RBIs and an on-base percentage of .453.McCovey spent 19 of his 22 major league years with the Giants. He was traded to the San Diego Padres in 1973 and then played briefly with the Oakland A's in 1976. He returned to the Giants in 1977 hitting 28 home runs and winning the Sporting News NL Comeback Player of the Year award.As ESPN ,\"One honor that eluded McCovey was a World Series ring. He came close in 1962, coming up short in a nail-biting seven-game series against the Yankees. McCovey went to the plate with two outs in the bottom of the ninth inning, his team down 1-0, with runners on second and third base. McCovey sliced a hit toward right field that looked like it could drive in the winning run but instead was caught by Yankees second baseman Bobby Richardson to end the game and the series. The moment was so iconic that it was featured in a Peanuts comic strip.\"That comic strip is shown McCovey retired in 1980 and voted into the Hall of Fame in 1986, and stands .He remained a fan favorite over the years, making frequent appearances at AT&T Park and always projecting an easy-going, dignified demeanor. In 1980, the Giants established the , an honor bestowed on the player who \"best exemplifies the spirit and leadership\" shown by McCovey.The San Francisco Bay water just beyond the right field wall at the park is known as \"McCovey's Cove\" even though he never played in that stadium. A statue of McCovey stands at the mouth of the Cove.", "title": "Hall Of Fame Slugger Willie McCovey Dies At Age 80", "author": "Richard Gonzales", "date": "October 31, 201811:21 PM ET"},
{"url": "https://www.npr.org/2018/10/31/662757630/u-of-maryland-says-it-will-part-ways-with-head-football-coach-dj-durkin", "body": "\n                University of Maryland head coach DJ Durkin was fired on Wednesday, a day after officials announced he could keep his job. He is pictured in November 2016.\n                \n                \n                \n            University of Maryland head coach DJ Durkin was fired on Wednesday, a day after officials announced he could keep his job. He is pictured in November 2016.A day after the University System of Maryland's board of regents chose to reinstate the head coach of the Terrapins, university President Wallace Loh announced on Wednesday he had fired DJ Durkin. \"A departure is in the best interest of the University, and this afternoon Coach Durkin was informed that the University will part ways,\" Loh addressed to the University of Maryland community. Severing ties with Durkin was a \"difficult\" decision, Loh said, but added, \"it is the right one for our entire University.\" Durkin has been accused of fostering an unhealthy culture of bullying among the team before the death of offensive lineman Jordan McNair earlier this year.  \"The chair of the Board of Regents has publicly acknowledged that I had previously raised serious concerns about Coach Durkin's return. This is not at all a reflection of my opinion of Coach Durkin as a person,\" Loh wrote. The decision to fire Durkin is a complete reversal from an , following months of investigation into the university's football culture after McNair's death. That announcement cleared the path for the coach to resume running the football program after months of paid administrative leave. McNair, who was sophomore, died on June 13, weeks after collapsing from heatstroke during a team workout on May 29. Hundreds of  students were expected to gather in the heart of campus on Thursday to protest Durkin's reinstatement, .  ", "title": "U. Of Maryland Says It Will 'Part Ways' With Football Coach DJ Durkin", "author": "Vanessa Romo", "date": "October 31, 20187:57 PM ET"},
{"url": "https://www.npr.org/2018/10/30/662271054/after-players-death-u-of-maryland-president-will-retire-but-football-coach-remai", "body": "\n                University of Maryland President Wallace Loh, seen here in August, said Tuesday that he will retire in June 2019.\n                \n                \n                \n            University of Maryland President Wallace Loh, seen here in August, said Tuesday that he will retire in June 2019.Five months after the death of University of Maryland football player Jordan McNair, the university system's board of regents has decided that football coach DJ Durkin and athletic director Damon Evans can both keep their jobs.University President Wallace Loh, however, will retire in June.At a press conference in Baltimore on Tuesday, Chairman of the Board of Regents James Brady said that the board had accepted all of the findings and recommendations from an independent commission's study on the culture of the university's football program.  , released publicly last week, found that the program did not have a \"toxic\" culture, but was an environment where problems festered because many players feared speaking out.Brady said that the commission had interviewed many people about Durkin, and admitted that many were critical of the coach and his leadership style. But others, he said, spoke with affection for him.After meeting with the coach, who has been on administrative leave since August, the regents decided that he should be allowed to keep his job.\"We believe that Coach Durkin has been unfairly blamed for the dysfunction in the athletic department. And while he shares some responsibility, it is not fair to place all of it at his feet,\" Brady said. \"We believe that he is a good man, and a good coach who is devoted to the well-being of student athletes under his charge. He is also at the beginning of his coaching career, with a great deal of promise, and much still to learn. We believe he deserves that opportunity.\"Loh, the university president since November 2010, said the regents had asked him to \"steer the ship to calmer waters\" by implementing reforms including improving the culture of the football program.\"In August, I accepted legal and moral responsibility for the mistakes that were made in the diagnosis and treatment of Jordan McNair,\" Loh said Tuesday. \"Today I stand by that statement 100 percent. And I will do everything possible to fulfill that responsibility.\"As NPR's Vanessa Romo , McNair, 19, \"died two weeks after collapsing from heatstroke during practice on May 29. He reportedly had a temperature of 106 and was hospitalized following the incident. But a McNair family attorney said the team personnel was slow to seek medical attention. , they waited an hour after the offensive lineman suffered a seizure before calling 911.\"Rick Court, the strength and conditioning coach who was leading McNair's last workout, resigned in August.  that when Durkin rejoined the team in a meeting on Tuesday afternoon, multiple players walked out. Some players, parents and boosters had called for Durkin's firing, including McNair's father.\"He shouldn't be able to work with anybody else's kid,\" Martin McNair  in August.In statement Tuesday afternoon, Athletic Director Damon Evans said the university would implementing every recommendation of the external commission. \"We have committed to doing everything in our power to make sure something like this never happens again, and that all of our student-athletes have a supportive environment.\"", "title": "After Player's Death, U. Of Maryland President Will Retire But Football Coach Remains", "author": "Laurel Wamsley", "date": "October 30, 20186:07 PM ET"},
{"url": "https://www.npr.org/2018/11/28/671488865/that-s-how-i-found-out-i-was-dead-soccer-club-fakes-player-s-demise-poorly", "body": "\n                Fernando LaFuente did not learn of his death until this week, days after his former team falsely reported it to the Leinster Senior Football League\n                \n                \n                \n            Fernando LaFuente did not learn of his death until this week, days after his former team falsely reported it to the Leinster Senior Football LeagueThe tragic phone call came in Friday morning. That's when , an amateur Dublin soccer team, told league officials that one of its players had been killed in a traffic accident on his way home from practice. Fernando LaFuente, sadly, had played his last game.The reaction was swift. Ballybrack's opponents that Saturday agreed to call off their scheduled game out of respect for LaFuente, and teams across the  observed somber  before they resumed play.Condolences to everyone involved at Ballybrack FC on the tragic passing of their player making his way home from training on Thursday night. All at Rush Athletic express our deepest sympathies.There was just one minor issue: Fernando LaFuente is very much alive.\"After my work finished I was playing some video games, and suddenly I got a call from work,\" LaFuente  on Wednesday. His coworkers called Tuesday night to check in on him. They'd seen reports about his \"accident.\"\"They started sending me all these news articles and all these mass media,\" he explained. \"And that's how I found out I was dead.\"As it turns out, Ballybrack officials had faked his death.A Spanish national, LaFuente said he had played on the team since January. But he dropped out about two months ago, when he left Ireland's capital for work in Galway, on the other side of the country. It appears at least one team manager used his move as a convenient opportunity to wriggle out of playing Saturday's match.Later asked why he thought the team did it, LaFuente said they were most likely just struggling with a thin bench as the game approached. \"I think maybe they had a rough time getting players,\" he told the Irish broadcaster. \"They don't play professionally. Most of them have regular jobs and some of them work in the UK or at university, people moving to other countries.\"League Chairman David Moran said the story began to come apart Monday, when he inquired about funeral arrangements. The team's response — that LaFuente's body had already been flown back to Spain — immediately \"rang alarm bells for us,\" Moran  on Tuesday.\"We checked the hospitals, we checked everywhere,\" Moran added. \"Nobody could find anything about this young fella.\"The jig was up.\"This grave and unacceptable mistake was completely out of character and was made by a person who has been experiencing severe personal difficulties unbeknownst to any other members of the club,\" Ballybrack FC said in a statement , noting that \"the person in question has been relieved of all footballing duties.\"Moran has promised a detailed investigation into what exactly happened.Meanwhile, observers have wasted little time cracking wise about the incident — including some of club's opponents: \"Any of the alive players from Ballybrack are more than welcome to come up training,\" Valeview Shankill FC . Another Irish club, which plays in another amateur league, was even moved to .A tribute to Ballybrack and Fernando      LaFuente himself said that as early as last weekend he was aware that  was up. His former teammates had warned him that he might see something online about his being in an accident but, he told RTE, \"I thought it was going to be a broken leg-type accident.\"When he found out the true scale of the lie, he reached out right away to his mother in Spain to let her know that all the reports of his death — including an obituary in the Dublin LaFuente noted — were greatly exaggerated.But all in all, this dead man walking is taking it in stride.\"It's serious on their part, but I'm finding it a little bit funny,\" he said. \"Because basically, I'm not dead.\"", "title": "'That's How I Found Out I Was Dead': Soccer Club Fakes Player's Demise (Poorly)", "author": "Colin Dwyer", "date": "November 28, 20181:04 PM ET"}
]