[
{"url": "https://nypost.com/2018/12/01/mets-would-land-closer-with-big-set-of-cojones-in-mariners-deal/", "body": "The anticipated news produced decidedly unmixed feelings for Joe Espada, the Astros’ bench coach who worked for Team Puerto Rico in last year’s World Baseball Classic and experienced the pleasure of being Edwin Diaz’s teammate.“If this trade goes down, I’m excited,” Espada, the Yankees’ former third-base coach, said Friday in a telephone interview. “I’m excited for him, and also that we wouldn’t have to face him next year.”“This trade” is of course the megadeal that would relocate Diaz and his even better known teammate, Robinson Cano, from the Mariners to the Mets in 2019 in return for five players. Mets rookie general manager Brodie Van Wagenen has made his first deal a franchise-shaking doozy, one that could go quite the distance in determining whether the Mets’ questionable hire succeeds.If the deal goes through, as widely expected, the Mets will agree to take on the ex-Yankee Cano, 36 and less than a year removed from an 80-game suspension for an illegal performance-enhancing drug offense, and pay him an average of eight figures through his age-40 season. They will give up two of their best prospects in pitcher Justin Dunn and outfielder Jarred Kelenic, as well as Jay Bruce and Anthony Swarzak, both of whom excelled in 2017 before stumbling last year, and relief pitcher Gerson Bautista.They will assume these considerable risks because they’re getting Diaz, the 2018 Mariano Rivera AL Reliever of the Year — who, by virtue of his youth, will cost a fraction of what his equivalents and inferiors will receive on the open market this winter and who won’t be eligible for free agency until after 2022. If Diaz can even approach the statistical excellence he exhibited last season — and, no small thing, prove he can handle the scrutiny of closing in New York — he can mitigate many of this trade’s other concerns.Because, man, was Diaz something else this past season. So much so that even his friends in the AL can’t wait to not see him anymore.The 2018 Mariners exceeded their run differential by 12 wins, and Diaz arguably can take the most credit for that impressive disparity. The 24-year-old registered 57 saves, tying Bobby Thigpen (1990) for the second-highest single-season total in baseball history behind the 62 Francisco Rodriguez tallied for the Angels in 2008. Diaz set his own record with 27 saves recorded upon entering the game with a one-run lead.He blew just four save chances, and in all of those, he allowed the opponent to only tie the game. The Mariners proceeded to win all four of those games, meaning they went 61-0 when they handed Diaz a save opportunity.In 73 ¹/₃ innings pitched, Diaz struck out 124 and walked 17, a 7.29 ratio that the great Rivera exceeded just twice in 19 years. Only the Dodgers’ Eric Gagne, in both 2002 and 2003, had put up at least 50 saves and 100 Ks in the same season. Is it any wonder Diaz received support for both the AL Cy Young Award (eighth place) and the AL Most Valuable Player honor (18th place)?“He had everything working for him this year,” said Espada, whose Astros managed a .303 OPS against Diaz in 27 plate appearances over eight games and .756 against everyone else. “He was really lights out.”The most encouraging news for Mets fans? Diaz didn’t emerge from oblivion to produce a potential one-hit wonder. Though 2018 established a new peak for him, it marked a continuation of what he already had displayed. Thanks to a lethal fastball-slider combination, he already has 109 career saves on his ledger, attained via an outstanding 156 ERA+ in 188 games totaling 191 innings.“This is a young kid that came to the big leagues when he only had a month of bullpen experience at the Double-A level,” Stottlemyre said. “Just from where he’s come up and where he is now, the feel for his stuff … Everybody knew that he had wipeout stuff, but it takes players time to put things together. The first couple years, I saw a lot of spots where young pitchers start to panic and are unsure. This entire year, from spring training on, he had the calmness and the confidence and the ability to slow the game down.”The key to elevating from, let’s say, a B-plus to an A-plus? In addition to growing mentally from his reps, Diaz grew his fastball. Not its velocity — it increased slightly from an average of 97.77 mph to 98.01, as per Brooks Baseball — but rather its quality and efficiency.“We really studied the Trackman to see where his best stuff played,” Stottlemyre said. “He would elevate his fastball and get a lot of swings and misses on fastballs in the zone. He threw more strikes and got more confidence.”Diaz threw his fastball for strikes 50.8 percent of the time in 2018, up from 47.5 percent in 2017, according to MLB.com. He located 56.4 percent of his fastballs within the strike zone after doing so 52.7 percent of the time the year before.Consequently, Diaz’s fastball pitch value, as calculated by FanGraphs, skyrocketed from 2.2 runs in 2017 to 13.8 last year.“His fastball command got him in good counts and in and out of at-bats quickly,” Stottlemyre said “Check out his average pitches per inning.”The Post acquiesced and verified Stottlemyre’s claims: In 2017, Diaz threw 1,172 pitches over 66 innings, an average of 17.8 pitches per inning. This past season, he threw 1,171 pitches over his 73 ¹/₃ frames, an average of 16 pitches per inning. His walks dropped from 32 to the aforementioned 17, and he halved his gopher balls from 10 to 5.The improved fastball led to Diaz using his slider more frequently (37.3 percent, up from 31.3 percent) and more successfully (a 53.8 whiff percentage, up from 46.5 percent).“That slider has come a long way in terms of the shape and the finish, and definitely its consistency in the zone,” Stottlemyre said. “Last year, he would throw a lot of them in and out of the zone. This year, if he came in with a three-run lead, he would tell me, ‘I’m not going to show my slider until I need it.’ He would go and try to bury guys with his fastball.“But with a one-run lead, against the middle of the lineup of [someone like] the Astros, he’d lean on his out pitches.”“The slider is his put-away pitch,” Espada said. “It looks very similar to his fastball.”It’s undeniable Diaz will bring elite stuff, assuming good health, to Queens. What is up for debate is whether he’ll bring a mentality to match. Though his detractors are difficult to locate here at the starting line.“He handled the WBC really well,” Espada said. “I know that it’s a high level of competition, but it’s nothing like closing a game in New York. It brings a different level of intensity, of focus. But if somebody can do it, this kid can do it. This kid is fearless.”“I think the key is he’s gone out and had bad games and struggled like all players do, and I’ve seen him get back on the horse like it never even happened,” Stottlemyre said. “They always say you’ve got to have a short memory, and he’s done that.”Or, as articulated by Noel Sevilla, the scout who signed Diaz for the Mariners, “He has a big set of cojones.”Many have espoused similar sentiments about Van Wagenen as word of these trade discussions became public. If Diaz lives up to his hype, he’ll help his new boss, also a stranger to this fishbowl, do the same.", "title": "Mets would land closer with ‘big set of cojones’ in Mariners deal", "author": "Ken Davidoff", "date": "December 1, 2018  4:41pm"},
{"url": "https://nypost.com/2018/12/01/money-going-to-puzzling-ends-at-mlb-and-rutgers/", "body": "Wait a second …MLB demanded the return of its $5,000 donation to the campaign of Mississippi Sen. Cindy Hyde-Smith after she made a comment about a “public hanging” that was deemed racist and the revelation that she attended a segregated high school.Wait. MLB donates to political campaigns? Regularly, tens of thousands of dollars, too. On whose instructions? The Office of the Commissioner of Baseball’s Political Action Committee. Huh?Why does MLB have/need a political lobby? Rob Manfred’s political operatives donated five grand, the legal maximum, to her campaign in exchange for what? Money for nothing?Was this donation to a candidate from a state that doesn’t have a big league team designed to buy influence or silence? One or both are what five grand donors expect in return.\nOr does MLB’s political lobby buy 50-state protection of its Federal antitrust exemption?Turns out MLB’s explanation on this one doesn’t conform to submitted facts. MLB claimed it made the donation in a one-shot deal, to attend a single fund-raiser “MLB lobbyists were asked to attend.”But public records show MLB donated $2,500 twice to her campaign, months apart.Regardless, for $5,000 MLB could have gifted Sen. Hyde-Smith two front row seats to a Yankees home game. Always plenty available!On the subject of curious, wait-a-second donations, last week Rutgers observed Giving Tuesday with two mass email solicitations.One was from and for the athletics department, no doubt in great financial need as its Big Ten football team has created a $35 million operations deficit, a hole so deep that taxpayer and student subsidizers can’t see its bottom.The other solicitation was on behalf of non-athletic scholarship RU students, specifically those in a bad way. Kerri Wilson, an RU director of housing:“At Rutgers University many students experience food insecurity. This can mean skipping meals or eating lower-quality food that doesn’t provide the nutrients they need to fuel their minds.“Each day I see students in need. Students who are uncomfortable asking for help. The Rutgers Student Food Pantry provides more than just a convenient, dependable source of groceries for the week …“Rutgers seeks to provide educational opportunities to students regardless of their economic background or income level. On a full stomach, students stand a better chance to excel, create and thrive at Rutgers.“Help scrap student hunger by making a gift today!”Starving, undernourished Rutgers students? Forgive my indelicate cynicism, Ms. Wilson, but I hope you spread that missive throughout RU’s Athletic Department. After all, since 2012 RU has burned tens of millions to sustain its deadly Big 10 football fever. But that’s RU’s No. 1 priority.Even the low end is costly. In 2016, RU paid its football-only weights training coach $260,000, roughly twice as much as full-time professors.Malnourished students? Truly sorrowful. But with the reminder that charity begins at home, begin with RU’s athletics department.Small wonder big-time college coaches are wary of media. What if they were asked a good question?What would St. Nick Saban say if asked why so many of his recruits are arrested, sometimes more than once. Alabama’s Reuben Foster, last week released by the 49ers after a second domestic-assault charge, was then quickly embraced by the whatever-it-takes ’Skins. Foster had previously pleaded guilty to possession of an assault rifle.That’s another thing. Why are so many recruits — as in countless — arrested on or near campus carrying deadly weapons?Isaiah Crowell, now a Jets running back, was enrolled at Georgia when arrested for felony possession of firearms — one with its serial number scraped off — “in a school zone.”Why would the most physically imposing men on campus need to carry deadly weapons? What do they anticipate? That kind of trouble? Are they exclusively defensive weapons, used only to return fire? From whom? Is there a beef with the chess club? “I’m off to college, with one in the chamber!”Fox’s Thom Brennaman is unafraid to speak impolitic truths during NFL telecasts. During Sunday’s Giants-Eagles, he followed an insert from Browns-Bengals with the rumor that recently fired Browns coach Hue Jackson may replace Bengals coach Marvin Lewis:“Could Hue Jackson possibly be in line to take over for Marvin Lewis? I live in that town [Cincinnati], and I’d venture to say if that happens they might not have 15 people at that stadium …\n“I’m not bashing Jackson, but when you go 15 years with the same head coach and you don’t win a playoff game [Lewis’ Bengals], hiring a guy who has won one game in the last two years would be tough to take.”In 15 seasons, Lewis’ Bengals were 0-7 in the postseason, including that last-seconds field goal loss to the Steelers three seasons ago, after Vontaze Burfict then Adam “Pacman” Jones were penalized a total of 30 yards after one play for out-of-control conduct — the most inexcusable loss in playoffs history.ESPN’s moral compass may as well be a windsock.For years its Bobby Knight-goes-nuts action reels were regular “SportsCenter” attractions.In 2008, ESPN hired him to analyze games. Presto! Those Knight-goes-nuts reels disappeared from ESPN.Only after Knight was not retained, in April 2015, did those highly disturbing, even historic moving images of Knight’s violent, wild-eyed behavior return on ESPN.And now ESPN’s presenting an independently produced, highly unflattering documentary about Knight — a program that would not be seen on ESPN had Knight still been employed by ESPN.But such contempt for integrity is nothing new. Just another reminder that you can’t shame the shameless.So Spurs’ coach Gregg Popovich says the 3-point shot is destroying the NBA — shoving the game further from a reliance on strong, two-way team play, making games mindless, shooting gallery farces. Agreed. But even if he’s the first NBA coach to speak that self-evident truth, what kept him?Now that running to first base is optional and commissioner Rob Manfred encourages kids to pose near home plate, reader Ted McNabb suggests that all ground-rule doubles — actually, “by-rule” doubles — “should be reduced to ground-rule singles.”What Nike money can do: Michigan amd Oklahoma football teams wears jerseys carrying a Nike logo depicting a man — Michael Jordan — playing basketball.Reader Jim Mitchell: “I watched the CFL’s Grey Cup championship. Canadian football is weird. Do you know they call putting it on the ground a ‘fumble’?”", "title": "Money going to puzzling ends at MLB and Rutgers", "author": "Phil Mushnick", "date": "December 1, 2018  5:21pm"},
{"url": "https://nypost.com/2018/12/01/shamorie-ponds-leads-furious-rally-to-keep-st-johns-perfect/", "body": "MIAMI — Saturday marked the 28th anniversary of one of St. John’s coach Chris Mullin’s greatest NBA games: He didn’t miss a single shot in a game at Miami, going a perfect 11 for 11 from the field and 5 for 5 from the foul line to help Golden State win.Clearly, something about December 1, Mullin and Miami just works.Shamorie Ponds scored 37 points, including a personal 9-0 run in the second half, and St. John’s rallied from a 16-point deficit to beat Georgia Tech 76-73 on Saturday in the HoopHall Miami Invitational.Mullin still remembers his perfect night in Miami. He won’t forget Ponds’ effort on the Heat floor anytime soon, either.“He had a better game than me,” Mullin said.High praise, and it was deserved as the Red Storm (7-0) stayed unbeaten — extending their best start since 1994-95. Ponds gave St. John’s a needed lift by connecting on a desperation heave from midcourt at the halftime buzzer, then carried the Red Storm in the second half.Over the final 13:37, he nearly outscored Georgia Tech himself — it was Yellow Jackets 22, Ponds 21 over that closing stretch.“Shamorie Ponds is an NBA guy, he hit some NBA-type shots,” Georgia Tech coach Josh Pastner said. “He’s really, really good.”Justin Simon and LJ Figueroa each scored 13 for the Red Storm.Jose Alvarado scored 17 for Georgia Tech (4-3), while James Banks III and Brandon Alston each scored 14 for the Yellow Jackets. Moses Wright scored 12 for Georgia Tech, which has dropped two straight.In Pastner’s two-plus seasons, the Yellow Jackets had never lost a game where they led by more than 13 — until now. Ponds made two free throws with 3.2 seconds left, and Alvarado tried a 70-footer when he could have easily taken another dribble or two before letting fly with the tying attempt.“He’ll learn from it,” Pastner said.St. John’s made its first four shots — then made four of its next 25, missing 12 straight over a stretch that lasted just over seven minutes.\nGeorgia Tech took full advantage.The Yellow Jackets went on a 16-0 run late in the half, turning a 24-17 deficit into a 33-24 lead. Banks had seven points in that run, and Georgia Tech’s lead was 38-29 at the half — with St. John’s ending its field-goal drought at the buzzer, when Ponds swished one from midcourt.“End of the half, they punched us in the mouth,” Ponds said. “So we had to respond.”Georgia Tech’s lead reached 16 points twice in the second half, the second of those coming on a layup by Wright with 15:06 left for a 51-35 edge.And then the pendulum started swinging back to St. John’s, with Ponds leading the charge.“We talk about dealing with adversity,” Mullin said. “When things go your way, it’s easy to go with the flow. When things get a little funky, that’s when it’s really important to rely on each other.”", "title": "Shamorie Ponds leads furious rally to keep St. John’s perfect", "author": "", "date": "December 1, 2018  2:40pm"},
{"url": "https://nypost.com/2018/12/01/seton-halls-offense-goes-quiet-late-in-ugly-loss-to-louisville/", "body": "Prosperity, as it turned out, was fleeting for Seton Hall. Just like the Pirates’ 12-point first-half lead Saturday and their nine-point edge in the second stanza.Such is life for a young team finding its way in this minefield of a non-conference schedule coach Kevin Willard formulated.Seton Hall showed its youth and was unable to finish off a quality opponent that was ripe to be put away. As a result, the Pirates couldn’t build off their impressive Wooden Legacy title from last weekend, suffering a bitterly disappointing 70-65 loss to Louisville in front of 8,505 at Prudential Center.“Getting this group to understand time and score, and opportunities, there’s no better way to do it [than] against these teams,” said a clearly frustrated Willard, who was uncharacteristically short with the media in his postgame press conference. “They made good plays and we didn’t.”There was the big lead early, a 19-7 edge just 7:17 in, and a 52-43 advantage with 13:52 left in the second half. But on each occasion, a few loose possessions cost the Pirates the chance to pull away, whether the result of bad shots, missed defensive assignments or being a step slow to a loose ball.The biggest problem was the 8:14 stretch of the second half in which Seton Hall (4-3) managed just a single field goal, allowing the Cardinals (5-2) to take control, turning a five-point deficit into a four-point lead.Before Myles Powell’s 3-pointer with 1:59 left, Seton Hall missed 19 of 21 shots, many of them contested drives or forced shots late in the shot clock. They mostly weren’t high-percentage attempts.“It’s frustrating,” sophomore forward Sandro Mamukelashvili said. “We’re a young team. Every time it comes down to the wire, I feel like everybody’s a little stressed. So we’ve got to chill out a little bit, trust each other more.”The Pirates still had opportunities late. With a chance to go ahead with just over a minute left, Myles Cale missed an off-balance runner in the lane on a disjointed possession and Ryan McMahon drained a crushing 3-pointer with 33.6 seconds left to push the lead back to four.Powell scored a game-high 23 points, but was just 2 of 12 from the 3-point line, and Willard said he felt some of the attempts were forced. Mike Nzei added 12 points with six rebounds, but the senior forward didn’t have many opportunities late. That, Willard said, needs to change. Seton Hall was too reliant on the drive.The final minutes were similar to the end of the loss at home to Saint Louis and the win over Miami in the Wooden Legacy final. With Powell hounded by double teams, someone else needed to take charge. It didn’t happen. In previous years, Seton Hall had several late-game options. Right now, there’s only Powell.“I think the biggest thing is other guys have to get a little bit more confident in the fact that they’re going to have to make a play,” Willard said. “[Quincy McKnight] got to the rim twice, Myles Cale got to the rim three times.“It’s obviously tough, because you want your main guy to have the rock, but those guys have to continue to get confidence that they’re going to get opportunities to make plays.”", "title": "Seton Hall’s offense goes quiet late in ugly loss to Louisville", "author": "Zach Braziller", "date": "December 1, 2018  2:34pm"},
{"url": "https://nypost.com/2018/12/01/nfl-needs-more-than-talk-to-curb-its-helmet-to-helmet-problem/", "body": "It happened Thursday in Dallas.It happened last week in Dallas.It’s happening every week, though not only in Dallas.Why, after the NFL made such a big deal about curbing helmet-to-helmet contact with its ballyhooed offseason initiative to protect its players, does it seem like dangerous helmet-to-helmet contact continues to occur without repercussions (but often with concussions) on a weekly basis?Surely, the NFL — with its army of spin doctors, analytics personnel and publicists — will produce data after the season to show how well it did to curb the helmet-to-helmet problem. But, regardless of what numbers they produce to the public, here’s a fact: It hasn’t been good enough.If you think it is, take a look at the hit by Dallas defensive back Jaylon Smith on New Orleans running back Alvin Kamara in Thursday’s 13-10 win over the Saints.The hit came on third-and-17 at midfield in the fourth quarter with the Saints trying to rally from a deficit. Kamara caught a pass from Drew Brees and gained eight yards before being punished by the Smith hit. A penalty would have given the Saints a first down at the Dallas 27. Instead, they would never get any closer to tying the game or taking the lead.Smith likely wasn’t trying to hurt Kamara, but it was clearly poor tackling technique, which should be penalized and it wasn’t. That had a major potential impact on the outcome of the game and, more importantly, could have seriously injured Kamara, one of the most dynamic players in the sport.When Brees was asked about the hit, he said, “What do you think? Let the league deal with that.”\t\t\t\tTherein lies the problem. They’re not dealing with it well enough.If the league’s officials cannot be counted on to make these calls, then there might have to be a special replay rule set up for helmet-to-helmet hits. Perhaps each coach can be given an extra challenge flag or two to throw when they believe a call has been missed.If you think the NFL is doing enough, then take look at the Cowboy’s 31-23 Thanksgiving win over the Redskins, when Washington tight end Jordan Reed was rammed in the helmet by the helmet of Dallas’ Xavier Woods on a key third down with the Redskins trying to rally from an 11-point deficit.Reed, who suffered two concussions while in college and has had a reported four more known concussions in the NFL, was so livid as he walked to the Washington sideline he angrily threw his helmet. He later tried to plead his case to the referees near the sideline.His words, and the words of too many offensive players in the league, fell on deaf ears.“I asked the referees [and] they said it wasn’t helmet-to-helmet on the field,” Redskins coach Jay Gruden told reporters the day after the game. “But clearly, when you watch it was. Just a play that they missed for some reason. And when it’s that blatant in front of a lot of people in the middle of the field, you just wonder why that wasn’t called if we’re talking about protection of the players.“It’s just frustrating because that’s a point of emphasis, so to speak.”So to speak.", "title": "NFL isn’t backing up its tough talk on this player-safety issue", "author": "Mark Cannizzaro", "date": "December 1, 2018  2:06pm"},
{"url": "https://nypost.com/2018/12/01/the-nl-east-is-baseballs-most-intriguing-division/", "body": "Unless the Pirates think they can overtake the Brewers, Cubs and Cardinals and capture the NL Central, then the NL East is the lone division that contains four teams that are approaching this offseason with designs on finishing first in 2019.That already has led to the Braves giving $23 million for one year to Josh Donaldson, the Mets moving to the brink of investing a large sum to obtain Robinson Cano and Edwin Diaz, and that is before the Phillies even get a “little bit stupid” in spending their money this offseason. The Nationals have yet to make public whether they will make an 11th-hour bid to retain Bryce Harper or reroute those dollars to bolster their rotation, in particular.The Marlins are the non-contender of the division, yet are intriguing because in J.T. Realmuto they arguably have the most attractive trade piece of this offseason.Ladies and gentleman, the NL East, the most interesting division in the world:Mets — Brodie Van Wagenen has not tiptoed into the GM responsibility. His first major player transaction would go right into the doozy category. He is on the brink of trading two of the team’s best prospects (Justin Dunn, Jarred Kelenic) while absorbing a good deal of Cano’s pact to land elite closer Edwin Diaz.Van Wagenen is determined to honor his press conference promise to contend in 2019. He seems to think upgrading defense and bullpen are central to do that, so Diaz is not the only reliever the Mets will obtain this offseason. An Andrew Miller (who played for Mickey Callaway in Cleveland) or David Robertson is possible. So is trading Noah Syndergaard if Van Wagenen could mesh finding particularly catching and center field upgrades with landing a free-agent starter who can ably replace Syndergaard.Van Wagenen has demonstrated energy, fearlessness and showmanship early in his tenure. Will that translate into 90-plus wins?Braves — The defending East champs are gambling that Donaldson and Brian McCann — both bedevilled by 2018 injuries — still have high-end production in their games. If so, Atlanta already has gone a long way to addressing priority one this offseason: an offensive boost. They still seek a corner outfielder — Andrew McCutchen? Michael Brantley? — to join a lineup with Ronald Acuna, Freddie Freeman and Ozzie Albies, plus Donaldson and McCann.Atlanta has a deep farm system and dollars to spend to pursue end-game bullpen and a top-of-the-rotation starter.Phillies — But no team has more to spend this offseason than Philadelphia. It was owner John Middleton, who recently said, “We’re going into this expecting to spend money. And maybe even be a little bit stupid about it.’’The feeling around the sport has been that the Phillies leave the offseason with Harper or Manny Machado — with a slim chance of both. Plus, they are in on top starters such as Patrick Corbin. Plus they are in on top relievers such as Zach Britton. Plus, they are involved in myriad trade scenarios, including about Seattle shortstop Jean Segura.No team faces more pressure to take big pieces off the board this offseason.Nationals — I am surprised how many executives and agents I speak to feel Harper still ends up back here (and Machado in Philadelphia). Whether it was done for public relations to suggest effort or for real, the Nationals’ reported $300 million offer to Harper in late September felt like a last effort to keep a homegrown star.And it is not hard to make a case that the Nats are better off with a divorce from Harper and having Adam Eaton, Victor Robles, Juan Soto and Michael Taylor share the outfield rather Washington already has obtained two relievers (Kyle Barraclough and Trevor Rosenthal) and two catchers (Yan Gomes and Kurt Suzuki) to try to distance themselves from 2018, when they were the majors’ most disappointing team.Marlins — Realmuto is the kind of talent — especially when available prime-aged star catchers are all but non-existent — that makes teams change plans. But clubs have said Miami’s requests have been so exorbitant as to all but make Realmuto unmovable. Perhaps, that is only an opening gambit. But the Braves and Nationals — perhaps the teams that expressed the most interest in the past 12 months — have locked in two catchers each on major league contracts. An official from one of those teams said, “Miami is not trading him in the division.”If true, that would take the interested Phillies out, too. The Astros, Brewers and others, though, remain interested.If Realmuto is traded, the Marlins will have depleted themselves of all their star-level players. Which is probably the right approach. Since in this version of the NL East, a team is going to need multiple difference-makers to emerge as the division champ.", "title": "The NL East is baseball’s most intriguing division", "author": "Joel Sherman", "date": "December 1, 2018  1:39pm"},
{"url": "https://nypost.com/2018/12/01/dez-bryant-deletes-instagram-post-putting-him-on-team-kareem/", "body": "Dez Bryant’s public support of Kareem Hunt didn’t last long.In a deleted Instagram post on Friday, the former Cowboys receiver was on “Team Kareem” following the running back being released by the Chiefs after a video of Hunt pushing and kicking a woman was published on TMZ.com.Bryant wrote in the post, which was up for around 15 minutes, that he wants to “know what provoked” Hunt and “what’s deeper than this video being surfaced around.” He later asked people not to be simple-minded while reading this post because “I never said I support domestic violence.”Bryant, who saw his return to the NFL with the Saints ended by a torn Achilles tendon at practice, appears in the post to be trying to caution athletes about getting into bad situations and for the public to not rush to judgment when incidents like Hunt’s occur.“I advise all future young stars this.. stay your course.. just because your money get better.. it’s doesn’t mean the prettier women is better,” Bryant wrote. “Protect yourself because it will only be one side of the story if you ever get into some [expletive] … save the explanation by knowing what you are after in life. Nobody is perfect. team Kareem.”\t\t\t\tEven after taking the Instagram post down, Bryant continued to defend it on Twitter.“I made it clear I don’t support domestic violence..,” he wrote in response to a fan questioning his post. “I believe we should make this issue bigger than the video that’s being surfaced around.. being provoked is a big issue.. especially for stars ..if we don’t learn to help and support others it stays a cycle.”Hunt was also placed on the commissioner’s exempt list by the NFL, meaning he cannot practice, play or attend games while the league continues to investigate.“At that time, the National Football League and law enforcement initiated investigations into the issue,” the statement read. “As part of our internal discussions with Kareem, several members of our management team spoke directly to him. Kareem was not truthful in those discussions. The video released today confirms that fact.”Bryant on the other hand hopes to rehab and continue his NFL career next season. When asked on Twitter if he will be back with the Saint, Bryant responded: “That’s the plan.”", "title": "Dez Bryant deletes Instagram post putting him on ‘Team Kareem’", "author": "Joseph Staszewski", "date": "December 1, 2018  1:17pm"},
{"url": "https://nypost.com/2018/12/01/former-nba-star-sues-united-airlines-over-in-flight-race-baiting/", "body": "A retired NBA star was escorted off a United Airlines flight this summer after a confrontation with a race-baiting flight attendant over switching seats, he claims in a lawsuit.Former Utah Jazz point guard Eric Murdock, 50, who once held the league record for steals, was flying home to Newark Airport from a Las Vegas conference on Flight 1537 in July when he asked to sit in the empty emergency exit row behind him with his son, who was seated in a different row, he said in a $10 million Brooklyn Federal Court lawsuit he filed with a fellow passenger.Flight attendants told him the row cost a “premium” price but didn’t say how much, Murdock claimed in court papers. When a ticketed passenger showed up for the space right before takeoff and offered to switch spots with the 6-foot-1 baller, he accepted.But an irate attendant wasn’t having it, Murdock claims.The “rude and dismissive” attendant, whom Murdock identified only as “Jane Doe,” ordered Murdock back to his assigned seat and claimed the row had to stay empty.But 30 minutes into the trip, she allowed a white woman to sit there and refused to explain the discrepancy to Murdock, who is black. The attendant was white.Another passenger, Brenda Williams, who is black and who did not know Murdock before the flight, questioned why Jane Doe was so rude to Murdock. The attendant allegedly screamed it was none of her business, accused her of recording the incident with her cell phone and tried to grab the device out of her hands, according to court papers.Murdock returned to his assigned seat. Later, when Jane Doe came down the aisle for beverage service, she allegedly asked Murdock if he was “going to boycott” drinks.The athlete “did not respond to the obvious race baiting,” according to the lawsuit.In a statement, Murdock said he feared the country’s current divisive climate”encourages people to be the worst versions of themselves.”When the plane finally landed, Murdock, a New Jersey native, and Williams, were escorted off by security and questioned by armed guards from the Transportation Security Administration, before being allowed to leave\nwithout charges.The “unjustifiable” removal, which happened in front of other professional athletes and colleagues of Murdock, was humiliating, claim Murdock and Williams in their discrimination lawsuit against United.A United spokeswoman said the company had “zero tolerance” for discrimination and would look into the allegations.", "title": "Former NBA star sues United Airlines over in-flight ‘race baiting’", "author": "Kathianne Boniello", "date": "December 1, 2018  11:26am"},
{"url": "https://nypost.com/2018/12/01/ohio-state-vs-northwestern-buckeyes-arent-going-to-cover-this-big-number/", "body": "Winning is not only a great deodorant, it’s also a painkiller. After weeks of anguished behavior on the sideline during stressful games, Ohio State coach Urban Meyer suddenly resembled a man without a care in the world last Saturday.The headaches seemed to disappear and the smile returned. A 23-point blowout of a rival in the biggest game of the year can be a miracle cure.The Buckeyes, 4½-point home underdogs, turned in by far their best effort in a 62-39 beatdown of Michigan. Ohio State’s stock in the college football betting market is now at a high point. In general, that means the public will be buying while sharper bettors must decide to sell or pass.Black Friday has passed and this is no bargain price — Ohio State is a 14½-point favorite over Northwestern in the Big Ten title game in Indianapolis on Saturday.The Buckeyes are instantly a sexy team after Dwayne Haskins passed for 396 yards and six touchdowns against a Wolverines defense that was dominant and highly respected. That type of performance makes an impression.On the flip side, the Wildcats were faded by sharp bettors most of the season. Analytics handicappers have been flummoxed by Northwestern, a mediocre team according to statistics and a team that seems to win with smoke and mirrors.Finally, Ohio State (11-1) is probably in the four-team playoff with a win. But that’s still up for debate, so Meyer knows surviving might not be enough and he could use a convincing win. If given the opportunity, Meyer will show no mercy.Still, the Wildcats (8-4) are the definition of gritty ’dogs. The underdog side is 11-0-1 against the spread in Northwestern games this season, with the Wildcats 5-0-1 in that role.While drama always surrounds Meyer, Northwestern coach Pat Fitzgerald, a blue-collar former linebacker, is the opposite. Bettors must decide between the favorite needing style points or taking a lot of points with an ugly ’dog.The play: Northwestern, +14½.", "title": "Ohio State vs. Northwestern: Buckeyes aren’t going to cover this big number", "author": "", "date": "December 1, 2018  10:45am"},
{"url": "https://nypost.com/2018/12/01/california-predicted-to-beat-stanford-in-ugly-game/", "body": "College football prediction on Stanford vs. California, Saturday, 3 p.m. at Memorial Stadium, Berkeley, Calif.:CALIFORNIA (+3) over Stanford: It’s not a conference championship game, but the “Big Game” always has meaning. If the Golden Bears get their way, it will be an ugly game. California coach Justin Wilcox has a defense that limited Washington (10), USC (14) and Washington State (19) to fewer than 20 points. Despite the presence of Bryce Love, the Cardinal running attack ranks among the nation’s worst. California is 4-1 ATS as an underdog this season.LAST WEEK: 1-1. SEASON: 14-12.VSiN’s Matt Youmans co-hosts “The Edge,” weekdays 3-5 p.m. on VSiN.com, fuboTV and SiriusXM 204. ", "title": "California predicted to beat Stanford in ugly game", "author": "", "date": "December 1, 2018  8:00am"},
{"url": "https://nypost.com/2018/12/01/georgia-vs-alabama-why-bulldogs-are-predicted-to-cover/", "body": "College football prediction on Georgia vs. Alabama in the Southeastern Conference Championship Game, Saturday, 4 p.m. at Mercedes-Benz Stadium in Atlanta:Georgia (+13) over Alabama: The Bulldogs have a veteran QB in Jake Fromm and plenty of skill-position speed to test the Tide defense. Even with a loss in the SEC Championship Game, Alabama is in the playoff. There is greater urgency for Georgia, which was getting only 3½ points in a 26-23 overtime loss to the Tide in the national title game in January.LAST WEEK: 1-1. SEASON: 14-12.VSiN’s Matt Youmans co-hosts “The Edge,” weekdays 3-5 p.m. on VSiN.com, fuboTV and SiriusXM 204.", "title": "Georgia vs Alabama: Why Bulldogs are predicted to cover", "author": "", "date": "December 1, 2018  7:00am"},
{"url": "https://nypost.com/2018/12/01/mets-mariners-trade-is-latest-lesson-in-naming-a-deals-winner/", "body": "Here’s the thing about predicting trades in real time:It’s like the way the late William Goldman once so perfectly described Hollywood: “Nobody knows anything.” We think we know. Fans do. Agents do. Sportswriters do. Talk radio does. We think we can spot a heist a mile away. But we can’t. Not every time.You may recall a column I wrote a few days ago that tore open the anxiety closets of Mets fans everywhere, detailing some of the worst trades in franchise history. But here’s the thing: In the moment, when they happened, most people thought the Mets had done wisely in both 1969 and 1971 when they traded away Amos Otis and Nolan Ryan — 13 All-Star Game appearances between them — for Joe Foy (from Kansas City) and Jim Fregosi (from the Angels).David Wright helped make this phenomenon go away, but the Mets searched for years — for decades — to find a reliable everyday third baseman. It was that obsession that made them pine for Foy and moon over Fregosi. And in the moment it seemed the Mets had done well — Otis never responded to Gil Hodges (who was certain to be in charge for a decade or more), and Ryan could never keep his blister-infested fingers out of Gus Mauch’s pickle jar.And … well. That isn’t how either trade is remembered now.Even trades that work out well for the Mets — Keith Hernandez-for-Neil Allen-and-Rick Ownbey — aren’t always what they seem. Yes, there was excitement when Frank Cashen pulled off that deal June 15, 1983, but there were also plenty of red flags: Allen was believed to be on the verge of stardom. Hernandez had been an MVP but was known to have his off-field demons and if Whitey Herzog didn’t want him on his team … well, what did that say?We can shout now, and we can feel like we’re right.But we won’t know. Not after a month. Not after a year. Maybe not until five or six years are past.And even then …This has always been one of my favorites:Many Mets fans jumped at a big omission from my column the other day: when they traded Rusty Staub to the Tigers for an all-but-finished Mickey Lolich. One reader, Lou Ventura, could even cite the date of the trade — Dec. 12, 1975 — instantly, as a date that will live in Mets infamy. And yes, that trade was crushing for the Mets. Lolich was 8-13 in his only year as a Met, and his physique made David Wells’ look like Kent Tekulve; Rusty was an All-Star in Detroit and finished fifth in the MVP vote in 1978 when he drove in 121 runs.But I ask you:As popular as Rusty was as a Met (and it was earned; not only was he a key cog in the drive to the ’73 pennant, but his charity work will forever be remembered and his good will forever revered), the Mets got 3 ½ years of Rusty’s prime (he missed 96 games in ’72 with a broken hand) in exchange for all but 184 games of Ken Singleton’s decidedly borderline Hall of Fame career (his lifetime OPS was .824; Rusty’s was .793, and as a Met it was .778).Couldn’t that be considered a steal, too?Maybe, maybe not. The fact is, it’s a definitely a point of conversation. Which, at their base, is what every trade should be. Like this one.Let’s just say that the NFL’s investigation of Kareem Hunt will probably never be ripped from the headlines for an episode of “Law & Order” — unless they want to make the cops look like bumbling buffoons.I threw this out on Twitter the other day, and do so again: This soccer neophyte needs guidance on how it possibly makes sense that the Red Bulls worked all year for home-field (er, home-pitch) advantage … yet when they took the pitch Thursday they were already hopelessly down 3-0? Can’t MLS either do one-game survive-and-advance like the NFL or a best-of-three? Help!If you haven’t read Peter Botte’s remarkable story commemorating the 40th anniversary of “The White Shadow” in Tuesday’s Post, two suggestions: 1. Read it immediately; 2. Cue up Hulu, where all the episodes are stored (yes, even Season 3, which we can all do without). Go hang with Cool, Thorpe, Salami and the crew for a few hours. You’ll be glad you did.Somehow it has been 31 years since “Season on the Brink,” and somehow the great John Feinstein continues to set a gold standard for sports books, this time with “Quarterback: Inside the Most Important Position in the National Football League.” Also worth your time: “Guts and Genius,” by Bob Glauber, telling the dueling stories of Bill Walsh, Bill Parcells and Joe Gibbs during the 1980s.Joseph Wilk: You forgot one the Mets won: Ed Heard-for-David Cone!Vac: They do tend to fall between the cracks, the good ones, don’t they?Steve Eiger: As a 69-year-old lifetime Mets fan, I remember all these blunders. Thanks for including the Amos Otis-for-Joe Foy deal, which most people seem to not recollect.\n\t\n\t\t\n\t\t\tsee also\n\t\t\n\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\n\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis old house: Islanders back at historic Nassau Coliseum\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\t\t\t\n\t\t\t\tOn Friday afternoon, Islanders coach Barry Trotz was reveling in...\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\nVac: It’s like a play on the old saying: Mets fans have forgotten more bad deals than most other fans remember.@drschnip: Pessimist: Cano is the new Robbie Alomar. Optimist: Cano is the new Carlos Baerga!@MikeVacc: #MetsTwitter has been an awful lot of fun this week!Marc Aronin: If you’re from New York City, you don’t get — maybe don’t even want to get — why the Islanders returning home to Long Island this weekend matters. Why despite losing John Tavares, this is as big a victory for the franchise and fans as they’ve had in years.@Vac: In a time of so much bad, the old hockey team returning to the new barn is a nice ray of sunshine", "title": "Mets-Mariners trade is latest lesson in naming a deal’s winner", "author": "Mike Vaccaro", "date": "December 1, 2018  3:38pm"},
{"url": "https://nypost.com/2018/12/01/tracing-how-giants-offensive-line-crumbled-around-manning/", "body": "The last years of Eli Manning’s prime were wasted because the Giants could not build a wall in front of him — could not find the kind of tough, smart, gritty, cohesive offensive linemen who would give life and limb to protect him.Once his old, reliable gang (Chris Snee, David Diehl, Shaun O’Hara, Rich Seubert, Kareem McKenzie) began growing old, Manning became a victim of too many costly personnel decisions in both the draft and free agency, and GM Dave Gettleman has only just begun the reconstruction.Here is a look at how the Giants have sacked Manning’s chances for a third Super Bowl ring:This was John Mara when Snee retired in June 2014: “I think Chris was everything you could ever hope for in a player: toughness, integrity and a lot of pride. Winning mattered to him. I think he set a great example for all of the other players. He’s somebody we’re going to miss very much. He was one of the greatest offensive linemen in Giants history, and he’ll be on that Ring of Honor someday.”This was Tom Coughlin when Diehl retired in January 2014: “When I think of David Diehl, what comes to mind is his indomitable spirit. He got the most out of his God-given ability and that’s the best way that you can judge any individual. What more can you ask of the guy?’’The Giants’ block-to-the-future plans have not gone well.\t\t\t\tThe drafting in the first round of Odell Beckham Jr. that year obscured a grievous mistake in the third round. Reese drafted defensive tackle Jay Bromley over guards Gabe Jackson and Trai Turner, and guard/center Brandon Linder. Jackson has started 70 games for the Raiders. Turner, a three-time Pro Bowler, has started 63 games for the Panthers. Linder has started 54 games for the Jaguars.Gettleman missed on free-agent guard Andrew Norwell and pivoted to left tackle Nate Solder (four years, $62 million) and guard Patrick Omameh (three years, $15 million) and drafted left guard Will Hernandez in the second round. Omameh moved to right guard and soon out the door. Spencer Pulley, claimed on waivers Sept. 2, is the fourth center since the end of last season. Right guard Jamon Brown was claimed on Oct. 31.“We’ve got to fix the O-Line, let’s be honest,” Gettleman said when he arrived last December.The shame of it all is that by the time it’s fixed, the odds are stacked against Manning celebrating it.", "title": "Tracing how Giants’ offensive line crumbled around Manning", "author": "Steve Serby", "date": "December 1, 2018  4:08pm"},
{"url": "https://nypost.com/2018/12/01/yankees-could-see-robertson-and-britton-go-to-red-sox/", "body": "Not only will the Yankees have to fill the vacancies created by the potential loss of free-agent relievers David Robertson and Zach Britton, there is a possibility the talented duo could land in their blood rivals’ bullpen.When asked about Robertson, who has a house in Rhode Island, landing a three-year deal with Boston, a person with knowledge of the situation replied, “The Red Sox are in for less.’’Which means the World Series champions are waiting to see if Robertson’s best offers will be for one or two years. And Britton, who will turn 31 on Dec. 22, could be looked upon by the Red Sox as their closer should Craig Kimbrel leave via free agency.After the Red Sox ended the Yankees’ season in four ALDS games, Britton hinted the winning culture in The Bronx was appealing to him and didn’t close the door on a return to the team he joined at the July 31 trade deadline from the Orioles. He appeared in 25 games for the Yankees and posted a 2.88 ERA in 25 innings.Closer Aroldis Chapman can opt out of a contract following the 2019 season and had tendinitis in his left knee that put him on the disabled list from Aug. 22-Sept. 19 this past season. So, the Yankees could bring Britton back as insurance against Chapman leaving two years and $35.4 million to chase more years and dollars. However, until an Achilles tendon injury that required surgery limited him to a total of 41 games this past season, Britton was among the best big league closers and there are several teams who still view the left-hander as an elite closer. From 2014 to 2016, Britton saved 120 games.So what can the Yankees do if Robertson and Britton don’t return? And how does the possibility of Dellin Betances leaving as a free agent following the 2019 season impact this winter’s decision?Could the Yankees sign free agent right-hander Nathan Eovaldi to be rotation insurance and work out of the bullpen until an injury or ineffectiveness forces a move with a starter?Right-hander Adam Ottavino, formerly of the Rockies, is on the Yankees’ radar as is former Yankee Andrew Miller, who pitched for the Indians in the final two months of 2016 and the past two seasons.A second reunion with Robertson is cloudy. In his first stab at free agency, when the right-hander was 29, the Yankees allowed him to flee for the White Sox and a four-year deal worth $46 million. Now, Robertson will turn 34 in April.And there was his role as chairman in a very disturbing postseason shares meeting that was annoying on several levels of the Yankees’ organization. But remember, all teams crave talent while often ignoring the warts and Robertson certainly performed well in 2018 when he went 8-3 with a 3.23 ERA and fanned 91 in 69 ²/₃ innings in 69 games. That was the most appearances by Robertson since 2013, when he worked 70 games for the Yankees.", "title": "Yankees could see Robertson and Britton go to Red Sox", "author": "George A. King III", "date": "December 1, 2018  4:19am"},
{"url": "https://nypost.com/2018/11/30/chiefs-star-kareem-hunt-pushes-kicks-woman-in-brutal-video/", "body": "Chiefs star running back Kareem Hunt has been sidelined as a result of an incident that took place in Cleveland this past February.Hunt, who grew up in a Cleveland suburb and played college ball at Toledo, can be seen pushing and kicking a woman in a Cleveland hotel in a video published Friday by TMZ.com.Hunt has been placed on the Reserve/Commissioner Exempt List by the NFL, which has opened an investigation into the video.“The NFL has placed Kareem Hunt of the Kansas City Chiefs on the Commissioner Exempt list, and as a result, he may not practice, play or attend games,” the NFL said in a statement. “The NFL’s investigation, which began immediately following the incident in February, will include a review of the new information that was made public today.”In the video, Hunt pushes the 19-year-old woman, then gets restrained before she slaps at him, sending him into a rage. Hunt then turns around the corner and storms into a man who collides with the woman, sending both to the floor.The woman, identified in February by Cleveland.com as Abigail Ottinger, of Middleburg Heights, Ohio, told police Hunt assaulted her at about 3:45 a.m. at Cleveland’s The Metropolitan at the 9 hotel. Another woman who was with Hunt’s friend said Ottinger had assaulted her, according to police reports obtained by Cleveland.com.According to TMZ, law enforcement obtained the video from The Metropolitan and submitted it to prosecutors, who elected not to charge Hunt. One police report listed Hunt as a suspect, while another listed Ottinger as such. Cleveland police Sgt. Jennifer Ciaccia said the cross complaint indicated that each person claimed they were victimized in the incident.Ottinger, a Kent State student, told cops in February the argument started when she refused to hook up with a member of Hunt’s entourage. One of Hunt’s friends told police they kicked Ottinger and her friend out of the room after learning that they were only 19 years old, but Ottinger said they were booted because she “didn’t want” one of the men in Hunt’s entourage.Ottinger was further accused of calling Hunt and his friend racial slurs when she was told that she needed to leave. Ottinger and her female friend then waited in a hallway as they tried to get a ride back to Kent State. Hunt’s friend told police he gave the women $20 and that the NFL running back decided to go to bed, according to the police report.Ottinger then stayed in the hallway for roughly 30 minutes as she continued yelling and pounding on the room door, her friend told police. Another woman in Hunt’s group, meanwhile, said she was struck in the face by Ottinger when she went into the hallway to tell the pair to leave, according to the police report.Ottinger told Cleveland.com that “things got physical” at the hotel, but declined further comment, as did her friend, according to the website.The NFL has yet to take any action against Hunt, who led the league in rushing last season, and it’s unclear if the league pursued the video the gossip site published. The Chiefs, who play at Oakland on Sunday, were originally unaware of the video, according to The Athletic.The footage is eerily reminiscent of the shocking Ray Rice video from 2014, when the former Ravens running back was seen punching his then-fiancée in the face in an Atlantic City hotel elevator. The NFL initially suspended Rice for two games, but when the video surfaced — also on TMZ — and the outcry was deafening, the Ravens released him and Rice was suspended for the full season. He has not played in the NFL since.Messages seeking comment from NFL and team officials were not immediately returned Friday.", "title": "Chiefs star Kareem Hunt pushes, kicks woman in brutal video", "author": "Joshua Rhett Miller", "date": "November 30, 2018  3:05pm"},
{"url": "https://nypost.com/2018/12/01/george-h-w-bushs-last-words-revealed/", "body": "Former President George H.W. Bush’s last words were “I love you, too” — spoken in response to his eldest son, former President George W. Bush, in a phone call Friday night.The elder Bush’s longtime friend and former secretary of state, James Baker, was quoted describing the departed leader’s final hours in the New York Times on Saturday.Bush, who was 94, died in his Houston home with son Neil and several friends and family members in the room. His other children spoke to him by phone in the last few minutes of his life–including the 43rd president, who praised him as a “wonderful dad.”“It was as gentle a passing as I think you could ever expect anyone to have,” Baker said. “And he was ready.”Bush’s health had been fading since the death of Barbara Bush, his wife of 73 years, in April. But he was well enough to attend the wedding of his granddaughter, also named Barbara Bush, in Maine in October.The Bushes made history as the first father-son presidential duo since John Adams and son John Quincy Adams were elected in the nation’s earliest decades.", "title": "George H.W. Bush’s last words revealed", "author": "Mary Kay Linge", "date": "December 1, 2018  4:14pm"},
{"url": "https://nypost.com/2018/12/01/egyptian-actress-charged-with-obscenity-for-wearing-revealing-dress/", "body": "CAIRO — An Egyptian actress is facing trial next month charged with public obscenity after she showed up at the closing ceremony of a film festival in Cairo wearing a see-through dress that revealed the entirety of her legs.Rania Youssef’s trial, which is scheduled to begin Jan. 12, follows a complaint to the chief prosecutor by a group of lawyers against the young actress.Egypt is a mostly conservative country with a Muslim majority. The Arab country of 100 million people has retained vestiges of secularism despite decades of growing religious conservatism, but Youssef’s case serves as a reminder that Islamic fundamentalism continues to have a voice five years after an Islamist president was ousted by the military amid mass protests against his rule.Youssef, who is in her 30s, faces up to five years in prison if convicted.", "title": "Egyptian actress charged with obscenity for wearing revealing dress", "author": "", "date": "December 1, 2018  7:56am"}
]